[
	{
		"text": "The company should publicly commit to respect users? human rights to freedom of expression and privacy.",
		"id": "C1",
		"name": " G1. Policy Commitment"
	},
	{
		"text": "The company?sÿsenior leadershipÿshould exerciseÿoversightÿover how its policies and practices affect freedom of expression and privacy.",
		"id": "C2",
		"name": "G2. Governance and management oversight"
	},
	{
		"text": "The company should have mechanisms in place to implement its commitments to freedom of expression and privacy within the company.",
		"id": "C3",
		"name": "G3. Internal implementation"
	},
	{
		"text": "The company should conduct regular, comprehensive, and credible due diligence, such asÿhuman rights impact assessments, to identify how all aspects of its business affect freedom of expression and privacy and to mitigate any risks posed by those impacts.",
		"id": "C4",
		"name": "G4. Impact assessment"
	},
	{
		"text": "The company shouldÿengageÿwith a range ofÿstakeholdersÿon freedom of expression and privacy issues.",
		"id": "C5",
		"name": "G5. Stakeholder engagement"
	},
	{
		"text": "The company should haveÿgrievanceÿandÿremedyÿmechanisms to address users? freedom of expression and privacy concerns.",
		"id": "C6",
		"name": "G6. Remedy"
	},
	{
		"text": "The company should offerÿterms of serviceÿthat areÿeasy to findÿandÿeasy to understand.",
		"id": "F1",
		"name": "F1. Access to terms of service"
	},
	{
		"text": "The company should clearly disclose that it providesÿnoticeÿandÿdocumentationÿto users when it changes itsÿterms of service.",
		"id": "F2",
		"name": "F2. Changes to terms of service"
	},
	{
		"text": "The company shouldÿclearly discloseÿthe circumstances under which it may restrictÿcontentÿorÿuser accounts.",
		"id": "F3",
		"name": "F3. Process for terms of service enforcement"
	},
	{
		"text": "The company shouldÿclearly discloseÿand regularly publish data about the volume and nature of actions taken to restrict content or accounts that violate the company?s rules.",
		"id": "F4 ",
		"name": "F4. Data about terms of service enforcement"
	},
	{
		"text": "The company shouldÿclearly discloseÿits process for responding toÿgovernment requestsÿ(including judicial orders) andÿprivate requestsÿto remove, filter, or restrictÿcontentÿorÿaccounts.",
		"id": "F5 ",
		"name": "F5. Process for responding to third-party requests for content or account restriction"
	},
	{
		"text": "The company should regularly publish data aboutÿgovernment requestsÿ(including judicial orders) to remove, filter, or restrictÿcontentÿorÿaccounts.",
		"id": "F6",
		"name": "F6. Data about government requests for content or account restriction"
	},
	{
		"text": "The company should regularly publish data aboutÿprivate requestsÿto remove, filter, or restrict access toÿcontentÿorÿaccounts.",
		"id": "F7 ",
		"name": "F7. Data about private requests for content or account restriction"
	},
	{
		"text": "The company shouldÿclearly discloseÿthat itÿnotifies usersÿwhen it restrictsÿcontentÿorÿaccounts.",
		"id": "F8 ",
		"name": "F8. User notification about content and account restriction"
	},
	{
		"text": "The company shouldÿclearly discloseÿthat it does notÿprioritize, block, or delay certain types of traffic,ÿapplications,ÿprotocols, orÿcontentÿfor any reason beyond assuring quality of service and reliability of the network.",
		"id": "F9 ",
		"name": "F9. Network management (telecommunications companies)"
	},
	{
		"text": "The company should clearly explain the circumstances under which it mayÿshut down or restrict access to the networkÿor to specificÿprotocols, services, orÿapplicationsÿon the network.",
		"id": "F10 ",
		"name": "F10. Network shutdown (telecommunications companies)"
	},
	{
		"text": "The company should not require users to verify their identity with their government-issued identification, or other forms of identification that could be connected to their offline identity.",
		"id": "F11",
		"name": "F11. Identity policy"
	},
	{
		"text": "The company should offerÿprivacy policiesÿthat areÿeasy to findÿandÿeasy to understand.",
		"id": "P1 ",
		"name": "P1. Access to privacy policies"
	},
	{
		"text": "The company shouldÿclearly discloseÿthat it providesÿnoticeÿandÿdocumentationÿto users when it changes itsÿprivacy policies.",
		"id": "P2 ",
		"name": "P2. Changes to privacy policies"
	},
	{
		"text": "The company shouldÿclearly discloseÿwhatÿuser informationÿitÿcollectsÿand how.",
		"id": "P3 ",
		"name": "P3. Collection of user information"
	},
	{
		"text": "The company shouldÿclearly discloseÿwhatÿuser informationÿitÿsharesÿand with whom.",
		"id": "P4 ",
		"name": "P4. Sharing of user information"
	},
	{
		"text": "The company shouldÿclearly discloseÿwhy itÿcollectsÿandÿsharesÿuser information.",
		"id": "P5 ",
		"name": "P5. Purpose for collecting and sharing user information"
	},
	{
		"text": "The company shouldÿclearly discloseÿhow long itÿretains user information.",
		"id": "P6",
		"name": "P6. Retention of user information"
	},
	{
		"text": "The company should clearly disclose to users whatÿoptions they have to controlÿthe company?sÿcollection,ÿretentionÿand use of their user information.",
		"id": "P7",
		"name": "P7. Users? control over their own user information"
	},
	{
		"text": "Companies should allow users to obtain all of theirÿuser informationÿthe company holds.",
		"id": "P8 ",
		"name": "P8. Users? access to their own user information"
	},
	{
		"text": "The company shouldÿclearly discloseÿits practices with regard toÿuser informationÿitÿcollectsÿfrom third-party websites orÿappsÿthrough technical means.",
		"id": "P9 ",
		"name": "P9. Collection of user information from third parties (Internet companies)"
	},
	{
		"text": "The company shouldÿclearly discloseÿits process for responding toÿrequests from governmentsÿand otherÿthird partiesÿforÿuser information.",
		"id": "P10 ",
		"name": "P10. Process for responding to third-party requests for user information"
	},
	{
		"text": "The company should regularly publish data aboutÿgovernmentÿand otherÿthird-party requestsÿforÿuser information.",
		"id": "P11",
		"name": "P11. Data about third-party requests for user information"
	},
	{
		"text": "The company shouldÿnotifyÿusers to the extent legally possible when theirÿuser informationÿhas beenÿrequested by governmentsÿandÿother third parties.",
		"id": "P12",
		"name": "P12. User notification about third-party requests for user information"
	},
	{
		"text": "The company shouldÿclearly discloseÿinformation about its institutional processes to ensure the security of its products and services.",
		"id": "P13 ",
		"name": "P13. Security oversight"
	},
	{
		"text": "The company should addressÿsecurity vulnerabilitiesÿwhen they are discovered.",
		"id": "P14 ",
		"name": "P14. Addressing security vulnerabilities"
	},
	{
		"text": "The company should publicly disclose information about its processes for responding toÿdata breaches.",
		"id": "P15 ",
		"name": "P15. Data breaches"
	},
	{
		"text": "The company shouldÿencryptÿuser communication and privateÿcontentÿso users can control who has access to it.",
		"id": "P16",
		"name": "P16. Encryption of user communication and private content (Internet, software, and device companies)"
	},
	{
		"text": "The company should help users keep theirÿaccountsÿsecure.",
		"id": "P17",
		"name": "P17. Account Security (Internet, software, and device companies)"
	},
	{
		"text": ""
	}
]