{"follow": 0, "companies": [{"name": "americaMovil", "levels": [{"text": 0, "scores": [{"score": "50", "response": "The company discloses that it prioritizes or degrades content delivery and the purpose of doing so."}]}], "id": "americamovil", "score": "50.00", "services": [{"sources": "19, 21", "score": "50.00", "type": "", "name": "Mobile", "comments": "In its statement on Net Neutrality and Policies for Traffic Management, Telcel discloses that it may block access to certain content apps or services to protect user privacy or secure the networks (source 19, p. 1, section 3, paragraph 1): Telcel \"podrá bloquear el acceso a determinados contenidos, aplicaciones o servicios con el fin de preservar la privacidad de los usuarios y la seguridad de la red.” In the same document, the company further lists several reasons for managing its traffic (source 19, p. 1, section 5, 5.­ Políticas de gestión de tráfico y administración de red) and explains why it prioritizes traffic (Source 19, Page 2, Section 5.4 Priorización de Tráfico). \n\nTelcel also engages in zero rating. The net neutrality document provides that the company offers a variety of plans and packages that may include different levels of capacity, speed, or quality (source 19, p. 1, section 4, Transparencia e información) . On the Telcel website, postpaid plan offerings (found on the website here: Personas --> Planes --> Renta) specify that certain uses of Facebook, Twitter, and WhatsApp do not count against the data plan, which means certain uses of those sites are essentially included in the plan. The Policy on Use of Covered Social Networks defines what constitutes usage (source 21). \n\nAlso, in its net neutrality statement, the company states that users have the right to use the equipment of their choice to access services, as long as it is approved, but that they cannot use any device on the network: \"[L]os usuarios tienen el derecho de utilizar para acceder a internet mediante la red de Radiomóvil, el equipo terminal de su elección siempre y cuando el mismo se encuentre homologado. Lo anterior no implica que cualquier equipo terminal que el usuario pretenda utilizar, reúna las condiciones técnicas necesarias para el acceso móvil a internet.” (source 19, p. 1, section 1, paragraph 2) "}], "type": "Telecommunications", "display": "America Movil"}, {"name": "at&t", "levels": [{"text": 0, "scores": [{"score": "50", "response": "The company discloses that it prioritizes or degrades content delivery and the purpose of doing so."}, {"score": "50", "response": "The company discloses that it prioritizes or degrades content delivery and the purpose of doing so."}]}], "id": "att", "score": "50.00", "services": [{"sources": "1,3", "score": "50.00", "type": "", "name": "Mobile", "comments": "AT&T's Broadband Information page provides \"information about the network practices, performance characteristics & commercial terms of AT&T's mass market broadband internet access services.\"\n\nIn the section titled \"Network Practices\" AT&T lists the steps it takes to manage congestion on its network. It says that it may reduce speeds (i.e. throttle) some users who have unlimited data plans. (The FTC sued AT&T for failing to disclose this to users - source 45). It also explains how it uses a process called \"Buffer Tuning\" to deliver video data for download. AT&T says it \"does not favor certain Internet applications by blocking, throttling or modifying particular protocols, protocol ports, or protocol fields in ways not prescribed by the protocol standards,\" suggesting it does not prioritize content. \n\nWith regards to devices, \"AT&T customers may attach 3G- or 4G-capable devices of their choice to our wired, mobile and Wi-Fi broadband Internet access services, so long as the devices do not harm our network or other users. AT&T will not activate 2G-only capable devices.\"\n\nIn addition, the postpaid ToS section 6.2. paragraph titled \"AT&T's Rights to Ensure Compliance\" and the prepaid ToS section titled \"Data\" paragraph 4 say that AT&T may engage in \"in any reasonable network management practice to enhance customer service, to reduce network congestion, to adapt to advances and changes in technology, and/or to respond to the availability of wireless bandwidth and spectrum;\" and that AT&T may reduce \"your data throughput speeds at any time or place if your data usage exceeds an applicable, identified usage threshold.\" The policies commit to notify users about what their usage thresholds are."}, {"sources": "6", "score": "50.00", "type": "", "name": "Fixed Broadband", "comments": "AT&T's Broadband Information page provides \"information about the network practices, performance characteristics & commercial terms of AT&T's mass market broadband internet access services.\"\n\nIn the section titled \"Network Practices\" AT&T lists the steps it takes to manage congestion on its network. It says that it may reduce speeds (i.e. throttle) some users who have unlimited data plans. (The FTC sued AT&T for failing to disclose this to users - source 45). It also explains how it uses a process called \"Buffer Tuning\" to deliver video data for download. AT&T says it \"does not favor certain Internet applications by blocking, throttling or modifying particular protocols, protocol ports, or protocol fields in ways not prescribed by the protocol standards,\" suggesting it does not prioritize content. \n\nWith regards to devices, \"AT&T customers may attach 3G- or 4G-capable devices of their choice to our wired, mobile and Wi-Fi broadband Internet access services, so long as the devices do not harm our network or other users. AT&T will not activate 2G-only capable devices.\"\n\nIn addition, The Internet ToS section 10.d explains network management practices.  Paragraph 1 explains what these practices are and why AT&T engages in them. Paragraph 2 says AT&T will notify users when it adopts a network management practice that affects a user's service. This notification will explain the practice, how it works, and how it could affect the service."}], "type": "Telecommunications", "display": "AT&T"}, {"name": "axiata", "levels": [{"text": 0, "scores": [{"score": "50", "response": "The company discloses that it prioritizes or degrades content delivery and the purpose of doing so."}]}], "id": "axiata", "score": "50.00", "services": [{"sources": "21, 15", "score": "50.00", "type": "", "name": "Mobile", "comments": "Celcom's TOS, Specific Terms and Conditions for Data Pay Per Use Service (Source 15, C, 4,1) states, \"You agree that Celcom: Reserves the right to manage your allocated bandwidth including but not limited to reducing your speed, suspend or terminate your bandwidth to the Service to ensure that fair access to all Celcom customers on the same network with or without prior notice to the you as prescribed in the Fair Usage Policy; and may, at its sole discretion, automatically disconnect your access to the Service after a period of your inactivity, which may vary from 20 minutes to 30 minutes to allow maximum network performance.\"\n\nCelcom's Fair Usage Policy (Source 21, section 2) states, \"The Services are designed as a shared service and customer's activities will impact on other users using and sharing the same network. To ensure fairness of usage and experience to all the First Data subscribers, Celcom has introduced and implemented the Fair Usage Policy. This Fair Usage Policy (\"Policy\") is designed to ensure that the Services received by the vast majority of the customers are not negatively impacted because of extreme heavy usage and abuse by the minority of the customers. Celcom shall continuously monitor the First Data network performance and may control the Internet connectivity speed of the identified heavy usage customers.\""}], "type": "Telecommunications", "display": "Axiata"}, {"name": "bhartiAirtel", "levels": [{"text": 0, "scores": [{"score": "50", "response": "The company discloses that it prioritizes or degrades content delivery and the purpose of doing so."}, {"score": "50", "response": "The company discloses that it prioritizes or degrades content delivery and the purpose of doing so."}]}], "id": "bhartiairtel", "score": "50", "services": [{"sources": "31, 10", "score": "50", "type": "", "name": "Mobile", "comments": "Bharti Airtel states that it may reduce speeds (i.e. throttle) some users who have unlimited data plans. Airtel's Fair Usage Policy (Source 31) states, \"Under the policy we have defined fair usage levels for unlimited data transfer plans and needless to mention, the usage levels set are very generous such that most customers will not be affected by the Fair Usage Policy. On reaching the fair usage level, the plan speed would be rationalized by up to 50% for the rest of the monthly billing cycle. You would also be redirected to a page which will inform you that the speeds for the rest of the billing cycle month would be as per the Airtel’s Fair Usage Policy. Please note that the speeds would be upgraded to the normal speeds at the start of the next billing cycle.\"\n\nIn explaining why it has this policy, Airtel states, \"A very small number of customers use an excessive amount of the network bandwidth, to the extent that it can impair the experience of others. The intent of Airtel's Fair Usage Policy is to provide the optimum internet experience to all customers.\"\n\nThe Telecom Charter (Source 10, p. 20) ToS on post-paid and fixed-line services states, \"With a view to give all Customers optimum Service, the Tariff plans offered by Airtel shall be subject to Fair-Usage Policy as formulated and implemented by Airtel from time to time.\""}, {"sources": "31, 10", "score": "50", "type": "", "name": "Fixed Broadband", "comments": "Bharti Airtel states that it may reduce speeds (i.e. throttle) some users who have unlimited data plans. Airtel's Fair Usage Policy (Source 31) states, \"Under the policy we have defined fair usage levels for unlimited data transfer plans and needless to mention, the usage levels set are very generous such that most customers will not be affected by the Fair Usage Policy. On reaching the fair usage level, the plan speed would be rationalized by up to 50% for the rest of the monthly billing cycle. You would also be redirected to a page which will inform you that the speeds for the rest of the billing cycle month would be as per the Airtel’s Fair Usage Policy. Please note that the speeds would be upgraded to the normal speeds at the start of the next billing cycle.\"\n\nIn explaining why it has this policy, Airtel states, \"A very small number of customers use an excessive amount of the network bandwidth, to the extent that it can impair the experience of others. The intent of Airtel's Fair Usage Policy is to provide the optimum internet experience to all customers.\"\n\nThe Telecom Charter (Source 10, p. 20) ToS on post-paid and fixed-line services states, \"With a view to give all Customers optimum Service, the Tariff plans offered by Airtel shall be subject to Fair-Usage Policy as formulated and implemented by Airtel from time to time.\""}], "type": "Telecommunications", "display": "Bharti Airtel"}, {"name": "etisalat", "levels": [{"text": 0, "scores": [{"score": "0", "response": "The company does not disclose information about prioritizing or degrading the delivery of content."}, {"score": "0", "response": "The company does not disclose information about prioritizing or degrading the delivery of content."}]}], "id": "etisalat", "score": "0.00", "services": [{"sources": "", "score": "0.00", "type": "", "name": "Mobile", "comments": "No evidence found."}, {"sources": "", "score": "0.00", "type": "", "name": "Fixed Broadband", "comments": "No evidence found."}], "type": "Telecommunications", "display": "Etisalat"}, {"name": "mtn", "levels": [{"text": 0, "scores": [{"score": "0", "response": "The company does not disclose information about prioritizing or degrading the delivery of content."}]}], "id": "mtn", "score": "0.00", "services": [{"sources": "3,10", "score": "0.00", "type": "", "name": "Mobile", "comments": "No evidence found regarding MTN's network management practices. The standard subscriber agreement (Source 3) Section 11.2 says users must only use approved devices, though it is unclear whether the company takes any action against use of non-approved devices. It is also unclear whether the company uses prioritization or degradation against users who may engage in any of the non-recommended activities listed in the \"Smartphone Internet Services\" (Source 10) section on \"Use of the Smartphone Services\" "}], "type": "Telecommunications", "display": "MTN"}, {"name": "orange", "levels": [{"text": 0, "scores": [{"score": "0", "response": "The company does not disclose information about prioritizing or degrading the delivery of content."}, {"score": "0", "response": "The company does not disclose information about prioritizing or degrading the delivery of content."}]}], "id": "orange", "score": "0.00", "services": [{"sources": "5", "score": "0.00", "type": "", "name": "Mobile", "comments": "No evidence found regarding Orange's network management practices. A July 2014 document about the company's position on net neutrality  (Source 5, p. 4) states that actors using more and more network capacity need 'to pay a fair share of the variable costs of the Internet asymmetric traffic they send'. However, the document does not reveal whether the company prioritizes or degrades the delivery of content."}, {"sources": "5", "score": "0.00", "type": "", "name": "Fixed Broadband", "comments": "No evidence found regarding Orange's network management practices. A July 2014 document about the company's position on net neutrality  (Source 5, p. 4) states that actors using more and more network capacity need 'to pay a fair share of the variable costs of the Internet asymmetric traffic they send'. However, the document does not reveal whether the company prioritizes or degrades the delivery of content."}], "type": "Telecommunications", "display": "Orange"}, {"name": "vodafone", "levels": [{"text": 0, "scores": [{"score": "100", "response": "The company discloses that it does not prioritize or degrade the delivery of content."}]}], "id": "vodafone", "score": "100.00", "services": [{"sources": "60, 22", "score": "100.00", "type": "", "name": "Mobile", "comments": "Vodafone UK has a page on traffic management (Source 60) that links to its traffic management practices for mobile and mobile broadband. This review focuses on the disclosure for mobile content (Source 22), which indicates that the company does not prioritize or degrade content. It discloses that adult services content is blocked, but content blocking is addressed in F3, not here.\n\nThe mobile traffic management document (Source 22) states that the company does not use traffic management \"to manage compliance with data caps and download limits.\" It also states that Vodafone does not use traffic management \"in relation to heavy users,\" although it does say, \"we would only block / throttle in the event of activity harmful to our network.\" "}], "type": "Telecommunications", "display": "Vodafone"}], "id": "F10", "name": "F10. Network management"}