{"follow": 0, "companies": [{"name": "americaMovil", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "50", "response": "partial"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "americamovil", "score": "33.33", "services": [{"sources": "14, 17", "score": "33.33", "type": "", "name": "Mobile", "comments": "Element 1: The Code of Business Practices does not provide evidence that the company will notify users when it makes changes (source 17, p. 9). It states that Telcel reserves the right to modify the terms at any time: \"Telcel se reserva en todo momento el derecho de modificar los términos y condiciones del presente Código de Prácticas Comerciales que a continuación se transcriben.” However, in the Service Delivery Agreement, the company provides detail about the method of notification of updates to the Code of Business Conduct. The company states that it will notify users of changes to the Code of Business Practices in writing in the next bill (source 14, p. 14, VIGÉSIMO CUARTA.­ CÓDIGO DE PRÁCTICAS COMERCIALES). In contrast, Telcel does not provide enough detail on notification about changes to the Service Delivery Agreement (source 14, p. 14, VIGÉSIMO SEXTA.­ MODIFICACIONES AL CONTRATO). It states that it will notify users if government authorities require the company to change the terms as well as if the company itself decides to change them: \"LA EMPRESA deberá notificar cualesquier tipo de cambio, al menos 15 días naturales previo a que dichas modificaciones surtan efecto por algún medio legalmente reconocido, incluido el electrónico,…\" The company discloses that this notification would take place through any legally recognized means, including electronic notification. In a separate section, the agreement (source 14, p. 14, VIGÉSIMO QUINTA.­ MEDIOS DE CONTACTO Y NOTIFICACIONES) states that users will provide their contact info (address, email address, phone number) to receive notifications from the company. Given that the company discloses the method of notification for changes to the Code of Business Practice but not for changes to the Service Delivery Agreement, the company receives partial credit. \n\nElement 2: Telcel discloses that it will notify users at least 15 days before the changes in the Service Delivery Agreement take effect (source 14, p. 14, VIGÉSIMO SEXTA.­ MODIFICACIONES AL CONTRATO). However, the Code of Business Practice does not contain a commitment to notify users about changes. As such, Telcel receives a partial score.\n\nElement 3: There is no evidence that Telcel keeps a public archive or change-log."}], "type": "Telecommunications", "display": "America Movil"}, {"name": "at&t", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "att", "score": "16.67", "services": [{"sources": "1, 2, 3, 5", "score": "16.67", "type": "", "name": "Mobile", "comments": "The term \"mobile ToS\" in this comment includes three sources: postpaid ToS (source 1), prepaid plan terms (source 2), and prepaid ToS (source 3). The mobile ToS include information about data services, so this evaluation does NOT include the separate data services agreement (source 4). The postpaid ToS references the AT&T Acceptable Use Policy (AUP - source 5), so this evaluation also includes the AUP.\n\nElement 1: The postpaid ToS (source 1, Section 1.3) says it, \"will provide you with notice of material changes (other than changes to governmental fees, proportional charges for governmental mandates, roaming rates or administrative charges) either in your monthly bill or separately.\" That paragraph later mentions that AT&T will notify users in their monthly bill, via text message, or other method about changes. However, the same document (source 1, Section 4.2) says, \"AT&T can revise its Acceptable Use Policy at any time without notice by updating this posting.\" The prepaid ToS (source 3, p. 3, \"Changes to Terms and Rates\") says it will provide users with notice of changes to terms via a recorded phone message, written notice mailed to the user's address, SMS, email, or another method. In addition to the comment in the postpaid ToS, the AUP does not commit to notify users of changes to the agreement. The company's postpaid and prepaid ToS commit to notify users about changes. The AUP allows the user to elect direct notification. For this reason, the company receives partial credit.\n\nThe Acceptable Use Policy links to subscription form in the upper left corner.  At the bottom of the page, it discusses how communications to users will be addressed:  “Contact Information: Any notification that AT&T sends to its Customers pursuant to this AUP will be sent via e-mail to the e-mail address on file with AT&T, or may be in writing to Customer's address of record.”  The subscription form also asks for contact information for use in providing notice of changes.  The subscription form asks for phone, email and street address.  Pursuant to the language quoted above, notice of changes will go to either email or street address.  However, to receive full credit, a company should allow for an opt-out feature rather than an opt-in feature.\n\nElements 2-3: No evidence found."}, {"sources": "5 and 6", "score": "16.67", "type": "", "name": "Fixed Broadband", "comments": "The Internet ToS (source 6) applies to AT&T U-verse High Speed Internet and AT&T High Speed Internet, along with other Internet offerings. The Internet ToS references the Acceptable Use Policy (AUP - source 5), so this evaluation covers the Internet ToS and the AUP.\n\nElement 1: Section 1 of the Internet ToS says AT&T will notify users of \"material changes\" to this agreement. It then lists a variety of methods, including an email, phone call, or direct mail to the user. The AUP allows the user to elect direct notification. For this reason, the company receives partial credit.\n\nThe Acceptable Use Policy links to subscription form in the upper left corner.  At the bottom of the page, it discusses how communications to users will be addressed:  “Contact Information: Any notification that AT&T sends to its Customers pursuant to this AUP will be sent via e-mail to the e-mail address on file with AT&T, or may be in writing to Customer's address of record.”  The subscription form also asks for contact information for use in providing notice of changes.  The subscription form asks for phone, email and street address.  Pursuant to the language quoted above, notice of changes will go to either email or street address.  To receive full credit, a company should provide an opt-out feature rather than an opt-in feature. Users should be notified by default unless they choose not to be notified of changes to the policy. \n\nElement 2: The Internet ToS does not mention a timeframe for notification. \n\nElement 3: No evidence found that AT&T maintains a public archive of previous policies or a change log. The AUP says it became effective on October 15, 2008, but it is not clear whether the policy has been updated since then. The Internet ToS says it was last updated on January 11, 2015."}], "type": "Telecommunications", "display": "AT&T"}, {"name": "axiata", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "axiata", "score": "0.00", "services": [{"sources": "15", "score": "0.00", "type": "", "name": "Mobile", "comments": "Element 1: In Section A, 5.2 of the Terms and Conditions, the company states, \"Celcom reserves the right at its absolute discretion, from time to time, to vary, add to or otherwise amend these Terms and Conditions or any part thereof, and such amendments shall be published on Celcom’s website. Your continued use of the Service after the effective date of any variation, addition or amendments to these Terms and Conditions shall constitute your unconditional acceptance of such variations, additions or amendment.” This does not constitute direct notification.\n\nElements 2-3: No evidence found."}], "type": "Telecommunications", "display": "Axiata"}, {"name": "bhartiAirtel", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "bhartiairtel", "score": "0", "services": [{"sources": "1,2,10", "score": "0", "type": "", "name": "Mobile", "comments": "Element 1: In the prepaid ToS found in the Telecom Charter (Source 10, p. 6, bullet point 2) states, \"...any change in tariff or related terms and conditions, schemes etc., communicated inter alia through SMS or USSD etc. shall be valid and proper intimation.\" This does not constitute a disclosure or notice of changes to the ToS. The postpaid ToS found in the Telecom Charter do not mention notice of ToS change. Neither the pre-paid website ToS nor the post-paid website ToS mentions notice of ToS change. \n\nElement 2-3: No evidence found."}, {"sources": "3,10", "score": "0", "type": "", "name": "Fixed Broadband", "comments": " Element 1: Neither the fixed line ToS found in the Telecom Charter nor the website ToS mentions notice of ToS change. \n\nElement 2-3: No evidence found."}], "type": "Telecommunications", "display": "Bharti Airtel"}, {"name": "etisalat", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "50", "response": "partial"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "etisalat", "score": "8.33", "services": [{"sources": "3, 4, 5, 6, 7, 19", "score": "0.00", "type": "", "name": "Mobile", "comments": "The prepaid TOS (Arabic-Source 4; English-Source 7, section 18, \"Amendments\"), section (a) states, \"Etisalat reserves the right to change, amend or reproduce these Terms and Conditions as it may deem fit.  Any such change, amendment or reproduction shall immediately be binding on the Customer from the date on which it is published by Etisalat.\"\n\nThe pospaid TOS (Arabic-Source 3; English-Source 6, section 13), section (a) states, \"Any changes to these terms and conditions, excluding price changes, shall be published on the Website and will be binding on the parties from the date on which the change is issued.\"\n\nNo evidence found in the smartphone plan TOS (Arabic-Source 5; English-Source 19)\n\nElements 1-3: The company does not commit to directly notify users about changes, nor does it provide any timeframe for changes. No evidence of an archive or change log found."}, {"sources": "2,17", "score": "16.67", "type": "", "name": "Fixed Broadband", "comments": "Element 1: The eLife TOS (Arabic-Source 2; English-Source 17) section 18 on \"Amendments\" states, \"Etisalat reserves the right to change, amend or reproduce these Terms and Conditions from time to time. Any such change, amendment or reproduction shall immediately be binding on the Subscriber from the date on which they are issued by Etisalat on its website (www.etisalat.ae).\" This does not contain a commitment to notify users about changes, and publishing changes on the website does not constitute direct notification of users.\n\nElement 2: The eLife TOS (Arabic-Source 2; English-Source 17) section 18 on \"Amendments\" states, \"Etisalat reserves the right to amend its charges from time to time, provided that any increase in charges is notified to the Subscriber with a minimum of 28 days’ notice prior to such revision.\" Since the company provides a timeframe for notice of price changes, but not other types of changes, the company receives partial credit.\n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "Etisalat"}, {"name": "facebook", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}]}], "id": "facebook", "score": "16.67", "services": [{"sources": "84", "score": "16.67", "type": "social network", "name": "Facebook", "comments": "Element 1: Facebook's ToS (Source 2),  Section 13, \"Amendments\" states: \"We’ll notify you before we make changes to these terms and give you the opportunity to review and comment on the revised terms before continuing to use our Services. If we make changes to policies, guidelines or other terms referenced in or incorporated by this Statement, we may provide notice on the Site Governance Page. Your continued use of the Facebook Services, following notice of the changes to our terms, policies or guidelines, constitutes your acceptance of our amended terms, policies or guidelines.\" Facebook commits to provide notification and allow users an opportunity to review and comment, however, it does not specify whether it will send a direct notification (e.g., email, SMS, etc) to inform users about any changes. For this reason, the company receives partial credit.\n\nElement 2: Facebook's ToS (Source 2) does not provide a timeframe within which it provides notice. When Facebook recently updated its terms, it posted a notice on its Site Governance page on Nov. 13, 2014 and the terms took effect on Jan. 1, 2015. However, since the company's terms do not explicly provide a timeframe, users cannot be sure whether a 7-week notice period is company policy. For this reason, the company does not receive credit on this element.\n\nElement 3: No evidence found."}, {"sources": "4", "score": "0.00", "type": "IM & calls", "name": "Whatsapp", "comments": "Element 1: WhatApp advises users to \"revisit [the privacy notice page] to stay aware of any changes.\" (Source 4). This does not constitute direct notification.\n\nElements 2-3: No evidence found."}, {"sources": "5", "score": "33.33", "type": "social network", "name": "Instagram", "comments": "Element 1: Instagram informs its users: \"You agree that we may notify you of the Updated Terms by posting them on the Service… Therefore, you should review these Terms of Use and any Updated Terms before using the Service.” This does not constitute direct notification. \n\nElement 2: Although Instagram states that \"we will provide reasonable advance notice before the Updated Terms become effective”, this does not provide an actual timeframe.\n\nElement 3: At the top of the \"Instagram Terms” page (Source 5), the company provides a link to earlier versions."}], "type": "Internet", "display": "Facebook"}, {"name": "google", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "google", "score": "55.56", "services": [{"sources": "Source 1: Terms of Service\nSource 2: Terms of Service Archive", "score": "83.33", "type": "search engine", "name": "Search", "comments": "Element 1: The TOS (Source 1) states under the section \"About these Terms\" that \"You should look at the terms regularly. We’ll post notice of modifications to these terms on this page. We’ll post notice of modified additional terms in the applicable Service.\" The company, however, does not commit to notify users directly, which means they may only see changes that affect them after going to the specific Terms page or possibly logging onto the website. It therefore only qualifies for 'partial' on this element.\n\nElement 2: Yes, the TOS (Source 1) states under the section \"About these Terms\" that \"Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted.\"\n\nElement 3: Yes, there is an archive of changes to the TOS, (Source 2 is an index of prior versions)."}, {"sources": "Source 1: Terms of Service\nSource 2: Terms of Service Archive", "score": "83.33", "type": "mail service", "name": "Gmail", "comments": "Element 1: The TOS (Source 1) states under the section \"About these Terms\" that \"You should look at the terms regularly. We’ll post notice of modifications to these terms on this page. We’ll post notice of modified additional terms in the applicable Service.\" The company, however, does not commit to notify users directly, which means they may only see changes that affect them after going to the specific Terms page or possibly logging onto the website. It therefore only qualifies for 'partial' on this element.\n\nElement 2: Yes, the TOS (Source 1) states under the section \"About these Terms\" that \"Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted.\"\n\nElement 3: Yes, there is an archive of changes to the TOS, (Source 2 is an index of prior versions)."}, {"sources": "Source 3: YouTube TOS", "score": "0.00", "type": "video/photo", "name": "Youtube", "comments": "Element 1: No, the YouTube TOS (Source 3), section 12, states that \"YouTube reserves the right to amend these Terms of Service at any time and without notice, and it is your responsibility to review these Terms of Service for any changes\".\n\nElement 2: No, YouTube reserves the right to amend the Terms of Service at any time and there is no indication of a notification time frame (Source 3).\n\nElement 3: No, there is neither a change log nor an archive of past Terms of Service."}], "type": "Internet", "display": "Google"}, {"name": "kakao", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "50", "response": "partial"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "kakao", "score": "83.33", "services": [{"sources": "6", "score": "100.00", "type": "search engine", "name": "Daum Search", "comments": "Element 1: The company discloses that it would notify users of changes to the ToS by email. (Article 2(3), source 6).\n\nElement 2: The company discloses two timeframes within which notification would take place, depending on the nature of the changes. Where the changes are deemed to be detrimental to users, the company undertakes to provide notification 30 days before the changes are implemented. Otherwise, the company states that it will notify users of changes 15 days before the changes are implemented. (Article 2(3), source 6). \n\nElement 3: At the bottom of the ToS page, the company features a link to the previous ToS -  \"이전약관 보” (Source 6)."}, {"sources": "6", "score": "100.00", "type": "mail service", "name": "Daum Mail", "comments": "Element 1: The company discloses that it would notify users of changes to the ToS by email. (Article 2(3), source 6).\n\nElement 2: The company discloses two timeframes within which notification would take place, depending on the nature of the changes. Where the changes are deemed to be detrimental to users, the company undertakes to provide notification 30 days before the changes are implemented. Otherwise, the company states that it will notify users of changes 15 days before the changes are implemented. (Article 2(3), source 6). \n\nElement 3: At the bottom of the ToS page, the company features a link to the previous ToS -  \"이전약관 보” (Source 6)."}, {"sources": "5/5.1", "score": "50.00", "type": "IM & calls", "name": "Kakaotalk", "comments": "Element 1: The company discloses that it will provide direct notification of changes to users, via email, when those changes are deemed to have adverse effects on users. Otherwise, it would provide notification of changes on the start-up page of the affected service. Since this affects only a certain category of changes, the company receives partial credit for this element. (Source 5.1)\n\nElement 2: The company discloses that it will provide direct notification of changes to users when those changes are deemed to have adverse effects on users. In such cases, users would be notified by email, 30 days before the implementation of the changes. In cases where the changes are not considered as having adverse effects, the company undertakes to post a notification on the start-up page of the affected service 15 days before the implementation of the changes. (Source 5.1)\n\nElement 3: No evidence"}], "type": "Internet", "display": "Kakao"}, {"name": "mailRu", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "mailru", "score": "0.00", "services": [{"sources": "4", "score": "0.00", "type": "social network", "name": "Vkontakte", "comments": "Element 1: In its terms of service, VK states that it is at liberty to make changes to the ToS with notifying users. It directs users to track the changes on the company website (section 2.4, source 4). \n\nElement 2: VK does not commit to provide notice within any time frame.\n\nElement 3: There is no evidence that VK keeps a public log of previous versions of its ToS."}, {"sources": "8", "score": "0.00", "type": "mail service", "name": "Mail", "comments": "Element 1: In its User Agreement, Mail.Ru specifies that it has no obligations to provide users with prior notice before making amendments to the user agreements (section 18, source 8).\n\nElement 2: Mail.Ru does not commit to provide notice within any time frame.\n\nElement 3: There is no evidence that Mail.Ru keeps a public log of previous versions of its ToS."}, {"sources": "8", "score": "0.00", "type": "", "name": "Mail.ru Agent", "comments": "Element 1: In its User Agreement, Mail.Ru specifies that it has no obligations to provide users with prior notice before making amendments to the user agreements (section 18, source 8).\n\nElement 2: Mail.Ru does not commit to provide notice within any time frame.\n\nElement 3: There is no evidence that Mail.Ru keeps a public log of previous versions of its ToS."}], "type": "Internet", "display": "Mail.Ru"}, {"name": "microsoft", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "microsoft", "score": "33.33", "services": [{"sources": "Source 02: Microsoft Services Agreement", "score": "33.33", "type": "search engine", "name": "Bing", "comments": "Element 1: The Microsoft Services Agreement (Source 2), section 7a states, \"We may change these Terms at any time, and we’ll tell you when we do. \" Section 4c states, \"Service Notifications. When there’s something important to tell you about a Service you use, we’ll send you Service notifications to the email associated with your Microsoft account or, for Skype notifications, your Skype account. If you authorized use of your phone number for your Microsoft account or Skype account, then we may send Service notifications to you via SMS (text message). Data or messaging rates may apply when receiving notifications via SMS.\" \n\nElement 2: The Microsoft Services Agreement (Source 2) states the date the terms were published and the date the terms went into effect. This suggests that the terms were available in advance for users to review. However, since the company's terms do not explicly commit to a timeframe, users cannot be sure whether such a notice period is company policy. For this reason, the company does not receive credit on this element.\n\nElement 3: No evidence found."}, {"sources": "Source 02: Microsoft Services Agreement", "score": "33.33", "type": "mail service", "name": "Outlook.com", "comments": "Element 1: The Microsoft Services Agreement (Source 2), section 7a states, \"We may change these Terms at any time, and we’ll tell you when we do. \" Section 4c states, \"Service Notifications. When there’s something important to tell you about a Service you use, we’ll send you Service notifications to the email associated with your Microsoft account or, for Skype notifications, your Skype account. If you authorized use of your phone number for your Microsoft account or Skype account, then we may send Service notifications to you via SMS (text message). Data or messaging rates may apply when receiving notifications via SMS.\" \n\nElement 2: The Microsoft Services Agreement (Source 2) states the date the terms were published and the date the terms went into effect. This suggests that the terms were available in advance for users to review. However, since the company's terms do not explicly commit to a timeframe, users cannot be sure whether such a notice period is company policy. For this reason, the company does not receive credit on this element.\n\nElement 3: No evidence found."}, {"sources": "Source 02: Microsoft Services Agreement", "score": "33.33", "type": "IM & calls", "name": "Skype", "comments": "Element 1: The Microsoft Services Agreement (Source 2), section 7a states, \"We may change these Terms at any time, and we’ll tell you when we do. \" Section 4c states, \"Service Notifications. When there’s something important to tell you about a Service you use, we’ll send you Service notifications to the email associated with your Microsoft account or, for Skype notifications, your Skype account. If you authorized use of your phone number for your Microsoft account or Skype account, then we may send Service notifications to you via SMS (text message). Data or messaging rates may apply when receiving notifications via SMS.\" \n\nElement 2: The Microsoft Services Agreement (Source 2) states the date the terms were published and the date the terms went into effect. This suggests that the terms were available in advance for users to review. However, since the company's terms do not explicly commit to a timeframe, users cannot be sure whether such a notice period is company policy. For this reason, the company does not receive credit on this element.\n\nElement 3: No evidence found."}], "type": "Internet", "display": "Microsoft"}, {"name": "mtn", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "50", "response": "partial"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "mtn", "score": "33.33", "services": [{"sources": "Source 2, Section 19\nSource 3, Section 16.1 and 16.2", "score": "33.33", "type": "", "name": "Mobile", "comments": "The Short Subscriber Agreement (Source 2) Section 19.2 says, \"MTN will endeavor to give you at least 20 (twenty) business days prior written notice (which includes notice by SMS) of any changes or amendments but is entitled to give you a shorter period of notice or no prior notice where this is reasonable in the circumstances or where it is necessary in order to comply with law or with the requirements of ICASA.\" \n\nThe Standard Subscriber Agreement (Source 3) Section 16.1 says, \"What changes are we allowed to make? We may make changes to  the Contract, the Charges, the Network Services and the Charge Limits by giving you (at least) 20 Business Days' notice in writing before we make a change,\" and section 16.2 says, \"Short or no notice - We may give you shorter notice or no notice, if it is reasonable  or if we have to comply with law or the requirements of ICASA.\"\n\nElement 1: The company says it may provide direct notification of changes via SMS, but it also says it may give no notice at all. For this reason, the company receives partial credit.\n\nElement 2: The company says it may provide notice 20 business days before changes take effect, but it also says it may give no notice at all. For this reason, the company receives partial credit.\n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "MTN"}, {"name": "orange", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "orange", "score": "50.00", "services": [{"sources": "3, section 12.2 page 2", "score": "50.00", "type": "", "name": "Mobile", "comments": "Element 1: Orange receives partial credit. In its 'General conditions of subscription to Orange offer', Orange France commits to inform customers of any 'contractual changes', at least one month before these changes enter into force. Although the company does not disclose a method of direct notification, the company commits to providing notification, therefore partial credit is awarded. \n\nElement 2: Orange receives full credit. Orange France commits to inform customers of any 'contractual changes', at least one month before these changes enter into force. \n\nElement 3: No evidence. "}, {"sources": "12 (article 17), 13 (article 20), 14 (article 17), 15 (article 20), 16 (article 21)", "score": "50.00", "type": "", "name": "Fixed Broadband", "comments": "Element 1: Orange receives partial credit. Orange does not provide the method of notification but does commit to informing customers of any contractual changes. In the references cited, Orange uses the following language: Orange may modify the terms or price of the service. The client will be informed of all modifications that concerns the client at least one month in advance of the implementation of the changes. In this situation, the client may terminate the contract. \n\nElement 2: Orange receives full credit. Orange specifies that it may modify the terms or price of the service. The client will be informed of all modifications that concerns the client at least one month in advance of the implementation of the changes. In this situation, the client may terminate the contract. \n\nElement 3: No evidence. "}], "type": "Telecommunications", "display": "Orange"}, {"name": "tencent", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "tencent", "score": "0.00", "services": [{"sources": "10", "score": "0.00", "type": "social network", "name": "Qzone", "comments": "Elements 1-2: The Qzone ToS informs users of Tencent’s right to modify the provisions and further states that “[y]ou can review the terms of the agreement in the latest version of the relevant service page\"(Source 10). This does not constitute direct notification to users.\n\nElement 3: No evidence found."}, {"sources": "8", "score": "0.00", "type": "IM & calls", "name": "Qq", "comments": "Elements 1-2: The QQ Software License and Service Agreement informs users of Tencent’s right to modify the provisions and further states that “[y]ou can review the terms of the agreement in the latest version of the relevant service page\"(Source 8). This does not constitute direct notification to users.\n\nElement 3: No evidence found."}, {"sources": "24", "score": "0.00", "type": "IM & calls", "name": "Wechat", "comments": "Elements 1-2: WeChat Software License and Service Agreement informs users of Tencent’s right to modify the provisions and further states that “[y]ou can review the terms of the agreement in the latest version of the relevant service page\"(Source 8). This does not constitute direct notification to users.\n\nElement 3: No evidence found."}], "type": "Internet", "display": "Tencent"}, {"name": "twitter", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "50", "response": "partial"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "twitter", "score": "25.00", "services": [{"sources": "1, 58, 98", "score": "33.33", "type": "social network", "name": "Twitter", "comments": "Element 1: Yes, Twitter states in its ToS that, \"If the revision, in our sole discretion, is material we will notify you via an @Twitter update or e-mail to the email associated with your account.\" It also publishes notifications of changes on its website. However, there is no evidence that Twitter directly notifies users of changes in the Rules. For this reason, the company receives partial credit.\n\nElement 2: No, there is no timeframe mentioned.\n\nElement 3: Yes, there is an archive of previous ToS (source 58). However, there is no evidence of an archive of previous versions of the Twitter rules. For this reason, the company receives partial credit."}, {"sources": "54, 55", "score": "16.67", "type": "video/photo", "name": "Vine", "comments": "Element 1: Yes, Vine TOS states \"If the revision, in our sole discretion, is material we will notify you via email to the email associated with your account or through the Services\" However, there is no evidence that Twiiter undertakes to notify Vine users of changes in the Vine Rules. For this reason, the company receives partial credit.\n\nElement 2: No evidence found.\n\nElement 3: No, there is no archive for Vine ToS. However, we recognize the possibility that the ToS has not changed since the service commenced."}], "type": "Internet", "display": "Twitter"}, {"name": "vodafone", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "50", "response": "partial"}]}], "id": "vodafone", "score": "16.67", "services": [{"sources": "2, 32, 33, 34, 35", "score": "16.67", "type": "", "name": "Mobile", "comments": "This includes a review of four mobile TOS: Pay-as-you-go (Source 33), pay monthly airtime (Source 34), Red+ (Source 35), and mobile broadband via the phone (Source 32).\n\nElement 1: The pay as you go TOS (source 33, §7) says users may be directly notified, even though the commitment is not entirely clear: \"The changes will apply when we publish details of them in a way which we consider is reasonable, for example by sending messages using the services.\" \n\nThe pay monthly TOS (source 34, §7) mentions that changes in charges may be advertised on the website (which is not direct notification), but these charges are not mentioned explicitly in the document in the first place. In case of changes to the actual terms, there is no mention of how customers may potentially be notified about such changes.\n\nThe Red+ TOS (source 35 §13) says \"We may vary or amend these terms from time to time, but if it’s to your disadvantage, we’ll give you at least 14 days’ notice of such a change,\" but this does not specify the method of notifying users. The mobile broadband TOS (source 32) does not contain any information about direct notification. \n\nBased on this disclosure, It is not clear that mobile users will receive direct notification from the company regarding changes to the TOS. As such, no credit is evaluated here.  \n\nElement 2: The Pay as you Go ToS (source 33, §7) contains no specific time period for notification: \"We may make changes to or withdraw services at any time and we can make changes to or introduce new terms to this agreement at anytime. If possible we will give reasonable notice of these changes.\"\n\nThe Pay Monthly ToS (source 34, §7) explains that \"We may change or withdraw services at any time and we may change or introduce new terms  to this agreement at any time. If we do, we'll give you at least 30  days' notice of these changes unless we believe such changes will not  disadvantage you or which you don't regularly use.\" The Red+ TOS (source 35 §13) says \"We may vary or amend these terms from time to time, but if it’s to your disadvantage, we’ll give you at least 14 days’ notice of such a change.\" Although these disclosures specify a time period, they state the user will only receive notification in situations where the company decides it is necessary. \n\nThe mobile broadband via the phone (source 32) document does not include information about when a customer may be informed about changes.\n\nGiven the lack of clear commitment to always inform customers within a certain time period, no credit is evaluated here.\n\nElement 3: The Vodafone UK page on \"Terms and Conditions\" (Source 2) contains a section for \"Previous Terms and Conditions.\" However it is unclear how the documents are organized. The Pay as you Go (source 33) and pay monthly (source 34) have archived versions available. For Red+ (source 35), even though the document indicates it is a latest version, no previous version is provided. No previous version of the mobile broadband is provided, though it is unclear whether the current version of the policy is the only version. Since two of the four TOS documents reviewed here are not in the archive, the company receives partial credit. "}], "type": "Telecommunications", "display": "Vodafone"}, {"name": "yahoo", "levels": [{"text": "1. The company discloses the method of direct notification to users (e.g., email, SMS, etc.).", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company discloses the timeframe within which it provides notification (e.g., two weeks prior to changes occurring).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company maintains a public archive or change log.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}]}], "id": "yahoo", "score": "33.33", "services": [{"sources": "Source 01: Yahoo TOS\nSource 02: Communications TOS", "score": "16.67", "type": "mail service", "name": "Mail", "comments": "Element 1: No, the Communications TOS (Source 2) states at the very top that, \"This ATOS may be updated by Yahoo from time to time without individual notice to you.\" The Yahoo TOS has a similar statement. However, Section 24 of the Yahoo TOS, \"Notice,\" says, Yahoo may provide you with notices, including those regarding changes to the TOS, including by but not limited to email, regular mail, SMS, MMS, text message, postings on the Yahoo Services, or other reasonable means now known or hereafter developed.\" While the company does list methods of direct notification, it does not commit to notify users, saying only that it \"may\" notify users. For these reasons, the company receives partial credit. \n\nElement 2: No evidence found.\n\nElement 3: No evidence found of archived version or change logs for the Communication TOS nor the Yahoo TOS."}, {"sources": "Source 01: Yahoo TOS\nSource 04: Flickr Community Guidelines", "score": "16.67", "type": "video/photo", "name": "Flickr", "comments": "Element 1: No, the Yahoo TOS (Source 1) states at the very top that, \"Yahoo provides the Yahoo Services (defined below) to you subject to the following Terms of Service (\"TOS\"), which may be updated by us from time to time without notice to you.\" However, Section 24, \"Notice,\" says, Yahoo may provide you with notices, including those regarding changes to the TOS, including by but not limited to email, regular mail, SMS, MMS, text message, postings on the Yahoo Services, or other reasonable means now known or hereafter developed.\" While the company does list methods of direct notification, it does not commit to notify users, saying only that it \"may\" notify users. The Flickr Community Guidelines also lack a commitment to notify users about changes. For these reasons, the company receives partial credit. \n\nElement 2: No evidence found.\n\nElement 3: No evidence found of archived version or change logs for the Yahoo TOS nor the Community Guidelines."}, {"sources": "Source 03: Tumblr TOS\nSource 05: Tumblr Community Guidelines", "score": "66.67", "type": "blog", "name": "Tumblr", "comments": "The Tumblr TOS section \"2. Modifications to this Agreement\" states that \"Tumblr reserves the right to modify this Agreement by (1) posting a revised Agreement on and/or through the Services and (2) providing notice to you that this Agreement has changed, generally via email where practicable, and otherwise through the Services (such as through a notification on your Tumblr Dashboard or in our mobile applications). Modifications will not apply retroactively. You are responsible for reviewing and becoming familiar with any modifications to this Agreement.\" The Tumblr Community Guidelines say, \"We also reserve the right to amend these guidelines using the procedures set forth in our Terms of Service.\"\n\nElement 1: Yes, the method is \"generally via email\".\n\nElement 2: No, there is no timeframe specified.\n\nElement 3: Yes, the Tumblr TOS and Community Guidelines have links to very nice changelogs done in GitHub."}], "type": "Internet", "display": "Yahoo"}], "id": "F2", "name": "F2. Terms of Service, notice and record of changes "}