{"follow": 0, "companies": [{"name": "americaMovil", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "americamovil", "score": "66.67", "services": [{"sources": "14, 17", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: In its Service Delivery Agreement and its Code of Business Practice, Telcel provides a list of prohibited activities. Most of these practices relate to uses of the network, but it also prohibits users from sending unauthorized text or multimedia messages for marketing or advertising purposes (source 14, p. 4, Definition of Práctica Prohibida; source 17, p. 6 Definition of Práctica Prohibida).\n\nElement 2: Telcel states that the company can stop providing service to users who engage in prohibited practices (source 14, p. 8, Section 8.H OBLIGACIONES DE LA EMPRESA).\n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "America Movil"}, {"name": "at&t", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}], "id": "att", "score": "83.33", "services": [{"sources": "1, 3, and 5", "score": "83.33", "type": "", "name": "Mobile", "comments": "Element 1. Postpaid ToS (source 1) section 4.2 says \"All use of AT&T's wireless network and Services is governed by AT&T's Acceptable Use Policy.\" The AUP maintains a list of prohibited activities. The postpaid ToS Section 6.2 includes a list of prohibited activities on AT&T's wireless data service. Section 6.5 paragraph 7 includes a list of activities that are not permitted on AT&T's messaging service (\"You further agree that you will not use our messaging service to...\"). The prepaid ToS (source 3), in the section titled \"Data\", includes a paragraph of \"Prohibited Data Activities.\" The section titled \"Text, Picture/Video Messaging and Instant Messaging\" paragraph 2 includes a list of activities that are not permitted on AT&T's messaging service (\"You agree you will not use our messaging services to...). The section titled \"Device\" paragraph 2 explains what users cannot do with their equipment (\"You also agree that you will not...\" and \"You agree not to take any  action to...\"). \n\nElement 2. The AUP, section \"AUP Enforcement and Notice\" paragraphs 1-2 explain how AT&T enforces this policy. Additionally, the postpaid ToS section 6.2, paragraph \"AT&T's Rights to Ensure Compliance\" explain how AT&T enforces its rules on use of the wireless network. Section 6.5 paragraph 7 explains how AT&T will enforce rules on its messaging service (\"AT&T reserves the right, but is not obligated, to...\"). The prepaid ToS in the section titled \"Data\", paragraph 4 explains how AT&T enforces its rules, saying, \"If you use wireless data services in any manner that is prohibited, we have the right to...\" The section titled \"Text, Picture/Video Messaging and Instant Messaging\" paragraph 2 explains how AT&T will enforce rules on its messaging service (\"AT&T reserves the right, but is not obligated, to...\"). The section titled \"Device\" paragraph 2 says, \"You will be liable to AT&T for any damages resulting from the conduct prohibited in this section.\"\n\nElement 3: The AUP provides a bulleted list of examples of \"Spam/E-mail/Usenet Abuse.\" The postpaid ToS section 6.2 provides a bulleted list of examples of the types of activities prohibited on the wireless data network. Similar language is in the prepaid ToS section on \"Data.\" However, the company does not provide examples that walk a user through the rules and how they are enforced. This information is scattered across various paragraphs in the ToS. Also, AT&T does not provide examples or clarifications for all of its articulated violations. This is particularly important when considering violations that might be interpreted subjectively. For instance, the \"threatening material\" section of the AUP could be guided by examples, but is not."}, {"sources": "5 and 6", "score": "83.33", "type": "", "name": "Fixed Broadband", "comments": "Element 1: The Internet ToS Section 10 says, \"use of the Site & Service is subject to the AT&T Acceptable Use Policy (\"AUP\"). The AUP maintains a list of prohibited activities. The Internet ToS (source 6) section 2.b explains the requirements around use of IP addresses. Section 7.a paragraph 4 explains what users are not permitted to do with AT&T equipment. Section 10 explains that users cannot resell services, infringe copyright, permit children under age 13 to use the service, or \"use the Service in a way which creates harm to the network, compromised capacity, degradation in network performance or service levels, or which may adversely impact access to or the use of the Service by other customers.\" Regarding content restriction, section 11.b  says, that while AT&T does \"not generally pre-screen or control Content that is posted by users, it has \"the right (but not the obligation) in its sole discretion to pre-screen, refuse or remove any Content that is available via our Site that is illegal, violates these Terms or the AUP, or exposes AT&T or Yahoo! to any risk of claims, lawsuits or liability.\"\n\nElement 2: The Internet ToS, section 10 paragraph 1 says, \"AT&T reserves the right to deny, disconnect, modify and/or terminate, without notice, the Member Account or the Service... to any customer whose use of the service violates the AUP.\" The AUP, section \"AUP Enforcement and Notice\" paragraphs 1-2 explain how AT&T enforces this policy. \n\nElement 3: The Internet ToS does not provide examples that walk a user through the rules and how they are enforced. The AUP provides a bulleted list of examples of \"Spam/E-mail/Usenet Abuse.\" Section 10 paragraph 1 provides a list of the types of activities the AUP prohibits. Also, AT&T does not provide examples or clarifications for all of its articulated violations. This is particularly important when considering violations that might be interpreted subjectively. For instance, the \"threatening material\" section of the AUP could be guided by examples, but is not."}], "type": "Telecommunications", "display": "AT&T"}, {"name": "axiata", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "axiata", "score": "66.67", "services": [{"sources": "15", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: Celcom's General TOS (Source 15, Section A, 4.2) lists what content and activities are prohibited.\n\nElement 2: Celcom's General TOS (Source 15, Section A, 22.2) states the company may, \"immediately suspend/terminate the Services or Agreement...If you breach any of the Terms and Conditions;\"\n\nElement 3: The company’s list of prohibited activities does not contain any examples to help users understand the rules. For instance, section A, 4.2(d) prohibits use of the service for any purpose that is against “public interest, public order or national harmony.” This is vague, and examples would assist in understanding the boundaries of acceptable conduct."}], "type": "Telecommunications", "display": "Axiata"}, {"name": "bhartiAirtel", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "bhartiairtel", "score": "33.33", "services": [{"sources": "10", "score": "33.33", "type": "", "name": "Mobile", "comments": "Element 1: The Telecom Charter (Source 10, p. 8) explains the types of content and activities that Airtel does not permit on its pre-paid services including  that users may \"...not use the services for any improper, immoral, unlawful, or abusive purpose, or for sending obscene, indecent, threatening, harassing, unsolicited messages or messages affecting/infringing upon national or social interest, nor create any damage or risk to Bharti Airtel Limited.\" Regarding post-paid services, the Telecom Charter (Source 10, p. 17) outlines the prohibited uses of the Airtel services noting that \"The Customer shall not use the Services for any unlawful, immoral or abusive purposes in violation or derogation of any law/rule or regulation or statutory directive or order for the time being in force or against any public policy or for sensing/receiving obscene, threatening, harassing message/communications or sending messages or communications that affect national interest, or create any damage or risk to airtel or its Network/equipments/call centre and/or other customers.\"\n\nElement 2: The Telecom Charter (Source 10, p. 8 and p. 17) does not explain how it enforces these rules. It simply states that Airtel shall not be held responsible for any consequences that arise if the user violates these rules.\n\nElement 3: There are no examples provided to help the user understand how the rules are enforced. "}, {"sources": "10", "score": "33.33", "type": "", "name": "Fixed Broadband", "comments": "Element 1: The Telecom Charter (Source 10, p. 17) outlines the prohibited uses of Airtel services, noting that, \"The Customer shall not use the Services for any unlawful, immoral or abusive purposes in violation or derogation of any law/rule or regulation or statutory directive or order for the time being in force or against  any public policy or for sensing/receiving obscene, threatening, harassing message/communications or sending messages or communications that affect national interest, or create any damage or risk to airtel or its Network/equipments/call centre and/or other customers.\n\nElement 2: The Telecom Charter (Source 10, p. 8 and p. 17) does not explain how it enforces these rules. It simply states that Airtel shall not be held responsible for any consequences that arise if the user violates these rules.\n\nElement 3: There are no examples provided to help the user understand how the Rules are enforced."}], "type": "Telecommunications", "display": "Bharti Airtel"}, {"name": "etisalat", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "etisalat", "score": "66.67", "services": [{"sources": "3, 4, 6, 7", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: Under its ToS for prepaid mobile services (Sources 4 and 7, Section 8, \"Suspension, Disconnection and Termination of the Service by Etisalat\"), Etisalat prohibits the following activities: 1) reselling or trading in telecommunications services without the appropriate license or the approval of Etisalat; 2) using profane language or fraudulently or maliciously using the telecommunications system in a manner prohibited by law; 3) committing any breach of these Terms and Conditions, in the opinion of Etisalat; or 4) breaching any law or the regulatory framework in the UAE. \n\nThe ToS for postpaid mobile services (Sources 3 and 6, Section 6, \"Legitimate Use of the Service\") have a list of prohibited activities such as: 1) violating the laws of the UAE, to further a criminal purpose, or infringe the rights including intellectual property rights of Etisalat or any third party and 2) circulation of material deemed contrary to, public morality, abusive, offensive, indecent, defamatory, obscene or menacing, or in breach, of any intellectual property rights, confidence privacy or any other rights or which is liable to incite racial disharmony or hatred, or which comprises a virus or other code liable to cause loss or damage.\n\nElement 2: In its ToS for prepaid mobile services (Sources 4 and 7, section 8), Etisalat 'reserves the right to suspend, disconnect or terminate one or more services provided to the Customer'. The company commits to notify the Customer prior to suspending, disconnecting or terminating the Service. In its TOS for postpaid mobile services (Sources 3 and 6, Section 6), Etisalat says that engaging in prohibited activities will also prompt the company to suspend or terminate the service, and/or 'take any further action in accordance with the law'. Given the lack of explanation about what such further actions may be, the company receives partial credit.\n\nElement 3: The company does not provide examples."}, {"sources": "2 and 17", "score": "66.67", "type": "", "name": "Fixed Broadband", "comments": "Element 1: The eLife TOS (Arabic-Source 2; English-Source 17) section 14a on \"Disconnection,  Termination and claiming compensation by Etisalat,\" states users may not, \"use Etisalat’s telecommunications system in a manner which is contrary to public morals, the religious values, social or moral welfare of the UAE, or is prohibited by law.  For example Subscribers must not use Etisalat’s telecommunications network to bully, intimidate or harass others, use profane language, carry out malicious or fraudulent activities or infringe third party rights or privacy; (v)unreasonably monopolise local line facilities; or (vi) in the opinion of Etisalat, commit any breach of these Terms and Conditions.\" \n\nElement 2: The eLife TOS section 14a state that if users engage in any of the behaviors listed in Element 1, \"Etisalat reserves the right to claim compensation and/or suspend or terminate at any time one or more  services rendered to the Subscriber, whether rendered under one or more contracts...\"\n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "Etisalat"}, {"name": "facebook", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "100", "response": "yes"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}]}], "id": "facebook", "score": "88.89", "services": [{"sources": "2,3", "score": "100.00", "type": "social network", "name": "Facebook", "comments": "Element 1: In its \"Community Standards\" document, Facebook provides extensive details on types of prohibited content under the headings, \"Helping to Keep you Safe\" and \"Encouraging respectful behavior” (Source 3).\n\nElement 2: In its \"Community Standards\" document, Facebook includes a section on \"Reporting Abuse,\" which states that, \"We have dedicated teams working around the world to review things you report to help make sure Facebook remains safe\" and that, \"The consequences for violating our Community Standards vary depending on the severity of the violation and the person's history on Facebook. For instance, we may warn someone for a first violation, but if we continue to see further violations we may restrict a person's ability to post on Facebook or ban the person from Facebook”. Facebook also provides that \"We can remove any content or information you post on Facebook if we believe that it violates this Statement or our policies.” (Source 2 section 5.2). Taken together, these statements indicate disclosure of a process of enforcement.\n\nElement 3: In its Community Standards, Facebook provides extensive details about prohibited content under the headings \"Helping to Keep you Safe\" and \"Encouraging respectful behavior.\" They include many specific examples, going so far as to have very detailed guidance on nipples: \"We also restrict some images of female breasts if they include the nipple, but we always allow photos of women actively engaged in breastfeeding or showing breasts with post-mastectomy scarring.” (source 3)."}, {"sources": "4", "score": "66.67", "type": "IM & calls", "name": "Whatsapp", "comments": "Element 1: WhatsApp outlines prohibited activities in its terms of service to include submission of copyrighted material without authorization; publication of misrepresentations; submission of \"unlawful, obscene, defamatory, libelous, threatening, harassing, hateful, racially or ethnically offensive\" material; advertisements or solicitations of business; impersonation; interference with the service. (Source 4, Section 3C). In addition, the company specifies that, \"Adult content must be identified as such\" (source 4, section D).\n\nElement 2: WhatsApp specifies in its terms of service that it will remove content (i.e., status submissions) where it is notified that the content violates copyright or contravenes its terms of service. It also discloses that it may terminate the accounts of users responsible uploading such content, without prior notice (Source 4, Section D).\n\nElement 3: No evidence found."}, {"sources": "5,7", "score": "100.00", "type": "social network", "name": "Instagram", "comments": "Element 1: Instagram outlines prohibited activities in its terms of service to include:  posting \"violent, nude, partially nude, discriminatory, unlawful, infringing, hateful, pornographic or sexually suggestive photos.\"; transferring accounts and accounts rights; defamation, harassment, impersonation and disclosure of confidential information; spamming and hacking.” (source 5)\n\nElement 2: In the Instagram Community Guidelines (source 7) Instagram details its process for enforcing its rules while allowing for nuances between situations. For example: \" People like to share photos or videos of their children. For safety reasons, there are times when we may remove images that show nude or partially-nude children. Even when this content is shared with good intentions, it could be used by others in unanticipated ways.\n\nElement 3: The \"Instagram Community Guidelines\" (Source 7) contains many examples. Like Facebook, there is even a nipple policy: \"we don’t allow nudity on Instagram. This includes photos, videos, and some digitally-created content that show sexual intercourse, genitals, and close-ups of fully-nude buttocks. It also includes some photos of female nipples.\""}], "type": "Internet", "display": "Facebook"}, {"name": "google", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}]}], "id": "google", "score": "77.78", "services": [{"sources": "60", "score": "66.67", "type": "search engine", "name": "Search", "comments": "Element 1: Google's Search Removal Policy (Source 60) states, \"We remove content from our search results if it includes: Child sexual abuse imagery. We also remove content in response to valid legal requests, such as copyright notifications that meet the requirements of the Digital Millennium Copyright Act...We may remove certain types of sensitive personal information from Google Search Results.\" It provides a list of the personal information that it does remove (e.g., credit card numbers) and does not remove (e.g. telephone numbers). \n\nElement 2: The Removal Policy (Source 60) states that it removes child sexual abuse imagery. The company only removes content in response to a legal request if the request is valid. The company explains its process for removing personal information: \"To decide if a piece of personal information creates significant risks of identity theft, financial fraud, or other specific harms, we ask:\n\nIs it a government-issued identification number?\nIs it confidential, or is it publicly available information?\nCan it be used for common financial transactions?\nCan it be used to obtain more information about an individual that would result in financial harm or identity theft?\nIs it a personally identifiable nude or sexually explicit photo or video shared without consent?\nWe apply this policy on a case-by-case basis. If we believe that a removal request is being used to try and remove other, non-personal information from search results, we will deny the request.\n\nNote: We usually don’t remove information that can be found on official government websites because the information is publicly available.\"\n\nElement 3: No evidence found."}, {"sources": "115", "score": "66.67", "type": "mail service", "name": "Gmail", "comments": "Element 1: In the Gmail Program Policies (115), Google outlines the content and activities it does not permit such as child sexual abuse imagery, harassment, unlawful activities or infringement of intellectual property rights.\n\nElement 2: The Gmail Program Policies state \"Google may disable accounts that are found to be in violation of these policies\" and has a form that users can submit to notify Google of potential violations. \n\nElement 3: No evidence found."}, {"sources": "4", "score": "100.00", "type": "video/photo", "name": "Youtube", "comments": "Element 1: Yes, the YouTube Community Guidelines (Source 4) includes general guidelines as well as two videos giving general guidance.  This page then links to various \"Help Documents\", of which 13 provide more specific guidance and examples.  They are:\n\n6        YouTube Help Harassment\n7        YouTube Help Hate Speech\n8        YouTube Help Impersonation\n9        YouTube Help Threats\n10        YouTube Help Child Endangerment\n11        YouTube Help Nudity Sex\n12        YouTube Help Violent Graphic\n13        YouTube Help Harmful\n14        YouTube Help Spam\n15        YouTube Legal Trademark\n16        YouTube Legal Counterfeit\n17        YouTube Legal Defamation\n18        YouTube Help Additional Policies\n\nElement 2: Yes, the main Community Guidelines page (Source 4) states under the heading \"We review your reports carefully\" that \"Our staff reviews flagged videos 24 hours a day, 7 days a week to determine whether they violate our Community Guidelines. When they do, we remove them. Sometimes a video doesn't violate our guidelines, but might not be appropriate for everyone. These videos may get age-restricted. Accounts are penalized for Community Guidelines violations, and serious or repeated violations can lead to account termination. If an account is terminated, that person won't be allowed to create any new accounts.\"\n\nElement 3: The following documents provide good examples:\n\n6        YouTube Help Harassment\n7        YouTube Help Hate Speech\n8        YouTube Help Impersonation\n9        YouTube Help Threats\n10        YouTube Help Child Endangerment\n11        YouTube Help Nudity Sex\n12        YouTube Help Violent Graphic\n13        YouTube Help Harmful\n14        YouTube Help Spam"}], "type": "Internet", "display": "Google"}, {"name": "kakao", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}], "id": "kakao", "score": "100.00", "services": [{"sources": "6,20", "score": "100.00", "type": "search engine", "name": "Daum Search", "comments": "Element 1: In its ToS, the company provides a list of proscribed activities and content, including information harmful to juveniles; information illegal under the Information and Communications Network Act; and information in violation of public order and good morals. (Article 13, source 6). In its Content Restriction Policy, the company also provides a list of prohibited content (Source 20).\n\nElement 2: The company states that if a member commits any of the prohibited activities, it may delete or temporarily obscure relevant postings, restrict the member's use of service, or terminate the contract unilaterally. (Article 13 paragraph 2 of source 6). The company further states that if a member violates its duties under the TOS, the company may restrict or terminate the member's use of service. (Article 11 paragraph 1 of source 6). It nonetheless undertakes to notify the member of the reason, duration and other details if in the event of a restriction or termination. (Article 11 paragraph 2 of source 6)\n\nElement 3: In its Content Restriction Policy, the company provides a list of prohibited content. It further explains the prohibitions with examples. For instance, under subheading \"2. Regarding Obscenity,” the company provides examples of prohibited obscene contents. Among these are: \"content that describes excessive exposure of nude or men's genitals or women's nipples”; and \"content that advertises, promotes, or intermediates prostitution or hostess bars or clubs.” (Source 20)"}, {"sources": "6,20", "score": "100.00", "type": "mail service", "name": "Daum Mail", "comments": "Element 1: In its ToS, the company provides a list of proscribed activities and content, including information harmful to juveniles; information illegal under the Information and Communications Network Act; and information in violation of public order and good morals. (Article 13, source 6). In its Content Restriction Policy, the company also provides a list of prohibited content (Source 20).\n\nElement 2: The company states that if a member commits any of the prohibited activities, it may delete or temporarily obscure relevant postings, restrict the member's use of service, or terminate the contract unilaterally. (Article 13 paragraph 2 of source 6). The company further states that if a member violates its duties under the TOS, the company may restrict or terminate the member's use of service. (Article 11 paragraph 1 of source 6). It nonetheless undertakes to notify the member of the reason, duration and other details if in the event of a restriction or termination. (Article 11 paragraph 2 of source 6)\n\nElement 3: In its Content Restriction Policy, the company provides a list of prohibited content. It further explains the prohibitions with examples. For instance, under subheading \"2. Regarding Obscenity,” the company provides examples of prohibited obscene contents. Among these are: \"content that describes excessive exposure of nude or men's genitals or women's nipples”; and \"content that advertises, promotes, or intermediates prostitution or hostess bars or clubs.” (Source 20)"}, {"sources": "5,8", "score": "100.00", "type": "IM & calls", "name": "Kakaotalk", "comments": "Element 1: The ToS illustrates some of prohibited activities and contents and refers to Operating Policy (OP). (Source 5). The OP clearly lists prohibited activities and contents under the heading \"Restrictions on Use of the Services.\" Those activities and contents include: illegal activities, obscene content, discriminatory/misleading behavior, spam/advertisements/promotions, account abuse, and others such as creating multiple accounts. (Source 8).\n\nElement 2: In the ToS, the company informs users that \"[i]f you fail to comply with the applicable laws, the Terms of Service and/or other policies of Daum Kakao, Daum Kakao may conduct an investigation into the matter or suspend your use of the Services either temporarily or permanently.” (Source 5). The ToS then refers to the Operating Policy, where the company lists three types restrictions: (1) restrictions on posts, (2) restrictions on services, and (3) restrictions on user accounts. The company specifies in the Operating Policy that users involved in prohibited activities may be restricted from using the Services without any prior notice. (Source 8).\n\nElement 3: In its Operating Policy, the company includes a section: \"Restrictions on Use of the Services.\" It lists six categories and specifies the prohibitions under each one in a bullet point form. For example, under the category, \"Obscene content,” the company explains that examples of \"gruesome or offensive photos or content\" are \"mauled bodies of people/animals or criminal scenes.” (Source 8)"}], "type": "Internet", "display": "Kakao"}, {"name": "mailRu", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "mailru", "score": "55.56", "services": [{"sources": "4", "score": "33.33", "type": "social network", "name": "Vkontakte", "comments": "Element 1: Vkontakte's ToS (Source 4, Section 6.3) provides a list of the types of content and activities the company does not permit.\n\nElement 2: Vkontakte's ToS (Source 4, Section 7.2.2) states, \"The Site Administration has the right but is not obliged to check the Site for prohibited Content and can delete or remove (without giving advance notice) any Content or Users at its own discretion for any reason or without reason, including, without limitation, removal or deletion of the Content which, in the personal opinion of the Site Administration, infringes these Terms, Russian legislation and/or may infringe the rights of, cause damage to, or threaten the security of other Users or third parties.\" This suggests the company can take action against any content or user for nearly any reason beyond those described in the TOS, and it does not give the user a sense of how the company enforces its rules.\n\nElement 3. No evidence found."}, {"sources": "8", "score": "66.67", "type": "mail service", "name": "Mail", "comments": "Element 1: In its User Agreement, Mail.Ru discloses the kinds of content and activities it prohibits (section 5.2, source 8) and informs users of their personal liability for published content (section 5.8, source 8).\n\nElement 2: In its User Agreement, Mail.Ru discloses that it retains the right to moderate or delete information posted by a user if it violates the ban disclosed in the User Agreement. It also states that it may suspend or terminate user accounts for engaging in the prohibited activities described in the User Agreement (section 8, source 8). All of this may be done without prior notice.\n\nElement 3: No evidence found."}, {"sources": "8", "score": "66.67", "type": "", "name": "Mail.ru Agent", "comments": "Element 1: In its User Agreement, Mail.Ru discloses the kinds of content and activities it prohibits (section 5.2, source 8) and informs users of their personal liability for published content (section 5.8, source 8).\n\nElement 2: In its User Agreement, Mail.Ru discloses that it retains the right to moderate or delete information posted by a user if it violates the ban disclosed in the User Agreement (section 8.3, source 8). It also states that it may suspend or terminate user accounts for engaging in the prohibited activities described in the User Agreement (section 8.4, source 8). All of this may be done without prior notice.\n\nElement 3: No evidence found."}], "type": "Internet", "display": "Mail.Ru"}, {"name": "microsoft", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}], "id": "microsoft", "score": "83.33", "services": [{"sources": "Source 01: Microsoft TOS\nSource 02: Microsoft Services Agreement", "score": "83.33", "type": "search engine", "name": "Bing", "comments": "Element 1: The Microsoft Services Agreement (Source 2) section 3a contains a numbered list of prohibited activities.\n\nElement 2: The Microsoft Services Agreement (Source 2) section 3b states, \"Enforcement. If you violate these Terms, we may stop providing Services to you or we may close your Microsoft account or Skype account. We may also block delivery of a communication (like email or instant message) to or from the Services in an effort to enforce these Terms or we may remove or refuse to publish Your Content for any reason. When investigating alleged violations of these Terms, Microsoft reserves the right to review Your Content in order to resolve the issue. However, we cannot monitor the entire Services and make no attempt to do so.\" Given the lack of clarity in the statement that the company may refuse to publish content \"for any reason,\" the company receives partial credit.\n\nElement 3: The Microsoft Services Agreement (Source 2) section 3a contains a numbered list of prohibited activities. This list includes examples (\"Don’t publicly display or use the Services to share inappropriate Content or material (involving, for example, nudity, bestiality, pornography, graphic violence, or criminal activity)....v. Don’t engage in activity that is false or misleading (e.g., asking for money under false pretenses, impersonating someone else, manipulating the Services to increase play count, or affect rankings, ratings, or comments)...Don’t engage in activity that is harmful to you, the Services, or others (e.g., transmitting viruses, stalking, communicating hate speech, or advocating violence against others).... Don’t infringe upon the rights of others (e.g., unauthorized sharing of copyrighted music or other copyrighted material, resale or other distribution of Bing maps, or photographs).\""}, {"sources": "Source 01: Microsoft TOS\nSource 02: Microsoft Services Agreement", "score": "83.33", "type": "mail service", "name": "Outlook.com", "comments": "Element 1: The Microsoft Services Agreement (Source 2) section 3a contains a numbered list of prohibited activities.\n\nElement 2: The Microsoft Services Agreement (Source 2) section 3b states, \"Enforcement. If you violate these Terms, we may stop providing Services to you or we may close your Microsoft account or Skype account. We may also block delivery of a communication (like email or instant message) to or from the Services in an effort to enforce these Terms or we may remove or refuse to publish Your Content for any reason. When investigating alleged violations of these Terms, Microsoft reserves the right to review Your Content in order to resolve the issue. However, we cannot monitor the entire Services and make no attempt to do so.\"  Given the lack of clarity in the statement that the company may refuse to publish content \"for any reason,\" the company receives partial credit.\n\nElement 3: The Microsoft Services Agreement (Source 2) section 3a contains a numbered list of prohibited activities. This list includes examples (\"Don’t publicly display or use the Services to share inappropriate Content or material (involving, for example, nudity, bestiality, pornography, graphic violence, or criminal activity)....v. Don’t engage in activity that is false or misleading (e.g., asking for money under false pretenses, impersonating someone else, manipulating the Services to increase play count, or affect rankings, ratings, or comments)...Don’t engage in activity that is harmful to you, the Services, or others (e.g., transmitting viruses, stalking, communicating hate speech, or advocating violence against others).... Don’t infringe upon the rights of others (e.g., unauthorized sharing of copyrighted music or other copyrighted material, resale or other distribution of Bing maps, or photographs).\""}, {"sources": "Source 02: Microsoft Services Agreement", "score": "83.33", "type": "IM & calls", "name": "Skype", "comments": "Element 1: The Microsoft Services Agreement (Source 2) section 3a contains a numbered list of prohibited activities.\n\nElement 2: The Microsoft Services Agreement (Source 2) section 3b states, \"Enforcement. If you violate these Terms, we may stop providing Services to you or we may close your Microsoft account or Skype account. We may also block delivery of a communication (like email or instant message) to or from the Services in an effort to enforce these Terms or we may remove or refuse to publish Your Content for any reason. When investigating alleged violations of these Terms, Microsoft reserves the right to review Your Content in order to resolve the issue. However, we cannot monitor the entire Services and make no attempt to do so.\" Given the lack of clarity in the statement that the company may refuse to publish content \"for any reason,\" the company receives partial credit.\n\nElement 3: The Microsoft Services Agreement (Source 2) section 3a contains a numbered list of prohibited activities. This list includes examples (\"Don’t publicly display or use the Services to share inappropriate Content or material (involving, for example, nudity, bestiality, pornography, graphic violence, or criminal activity)....v. Don’t engage in activity that is false or misleading (e.g., asking for money under false pretenses, impersonating someone else, manipulating the Services to increase play count, or affect rankings, ratings, or comments)...Don’t engage in activity that is harmful to you, the Services, or others (e.g., transmitting viruses, stalking, communicating hate speech, or advocating violence against others).... Don’t infringe upon the rights of others (e.g., unauthorized sharing of copyrighted music or other copyrighted material, resale or other distribution of Bing maps, or photographs).\""}], "type": "Internet", "display": "Microsoft"}, {"name": "mtn", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "mtn", "score": "33.33", "services": [{"sources": "Source 2, Section 9.1.1 and 9.1.2\nSource 3, Section 11.1, 11.2 and 11.3\nSource 10", "score": "33.33", "type": "", "name": "Mobile", "comments": "Element 1: The subscriber agreement (Source 2) Section 9.1.1 says users, \"will not use or allow the network services for any improper, immoral, fraudulent or unlawful purpose,\" and Section 9.1.2 says users, \"will not commercially exploit the network services nor allow the network services to be used for commercial purposes, including without limitation, the selling or reselling of the network services, bulk calling, bulk SMS, grey routing, least-cost routing (LCR)  or fixed terminals, for commercial or business purposes. Any use of the network services outside of what is considered reasonable for private non-commercial use and in instances through mechanisms and/or automated systems and means not intended for personal use, will be considered as abuse.\" Section 9.1.3 says, users, \"will only use mobile devices approved by ICASA together with the SIM Card on the network.\" Source 3 Sections 11.1, 11.2, and 11.3 have similar language. In addition, the policy on \"Smartphone Internet Services\" (Source 10) section on \"Use of the Smartphone Services\" says, \"The Services are not recommended to be used for the following: a) To download large files using Peer to Peer as well as video or music streaming.  b) As a modem connected to a personal computer or laptop. c) In a way that it does not comply with the Service’s primary intentions.\"\n\nElement 2: The agreements do not explain the company's process for enforcing these rules.\n\nElement 3: The agreements do not provide specific examples to help users understand the rules and how they are enforced."}], "type": "Telecommunications", "display": "MTN"}, {"name": "orange", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "50", "response": "partial"}, {"score": "100", "response": "yes"}]}], "id": "orange", "score": "91.67", "services": [{"sources": "2 (section 11.2, page 3)", "score": "83.33", "type": "", "name": "Mobile", "comments": "Element 1: Section 11.2 of the subscription conditions to Orange Mobile (Source 2), the company gives examples of and discloses types of activities and content it does not permit such as: 1) the spreading of viruses and any other file to limit, interrupt or damage the Orange network or any other telecommunication device. 2) the transmission of content and data that violate the legislation in force and which is deemed 'threatening', 'offensive' or 'defamatory'. 3) transmission of spam and junk mail. \n\nElement 2: Section 11.2 of the subscription conditions to Orange Mobile (Source 2), the company states that Orange could suspend and then terminate the contract of any client who does not follow the rules set out in section 11.2.\n\nElement 3: Orange receives partial credit. Orange does not provide examples of what would for instance be regarded as an 'offensive content'. For this reason, it does not meet the full requirements of Element 3. Also, Orange seems to reserve the right to terminate the subscriptions of users who set up Tor nodes (or similar), use VoIP services or connect to online discussion forums like Usenet (see Reference 2, section 11.2 for example, though the same language is present in the other reference documents)."}, {"sources": "13 (article 16, article 13.2.1), 16 (article 22.2.1, article 15) 12 (article 13, article 9.1) 14 (article 13, article 11) 15 (article 16, article 11)", "score": "100.00", "type": "", "name": "Fixed Broadband", "comments": "Element 1: yes"}], "type": "Telecommunications", "display": "Orange"}, {"name": "tencent", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "tencent", "score": "66.67", "services": [{"sources": "10", "score": "66.67", "type": "social network", "name": "Qzone", "comments": "Elements 1-2: The Qzone ToS includes a list of prohibited activities and states, \"If Tencent discovers or if other users report on or file complaints for activities in violation of this agreement, Tencent has the right to make independent judgment and take technical measures to delete, block or delink the relevant content, and, depending on the circumstances, impose punishments that include but are not limited to restrictions or prohibitions of the use of part or all of the functions of Qzone service or even QQ service, as well as investigations of legal liabilities.” (Source 10, Sections 7.1 and 7.2)\n\nElement 3: No evidence found."}, {"sources": "8", "score": "66.67", "type": "IM & calls", "name": "Qq", "comments": "Elements 1-2: QQ Software License and Service Agreement includes a list of prohibited activities and states, \"If Tencent discovers or if other users report on or file complaints for activities in violation of this agreement, Tencent has the right to make independent judgment and take technical measures to delete, block or delink the relevant content, and, depending on the circumstances, impose punishments that include but are not limited to restrictions or prohibitions of the use of part or all of the functions of Qzone service or even QQ service, as well as investigations of legal liabilities.” (Source 8, Sections 8.2, 8.3, 8.5, and 8.6)\n\nElement 3: No evidence found."}, {"sources": "24", "score": "66.67", "type": "IM & calls", "name": "Wechat", "comments": "Elements 1-2: The WeChat Software License And Service Agreement, section 8.1 includes a list of prohibited activities. The policy states, \"If Tencent discovers or if other users report on or file complaints for activities in violation of this agreement, Tencent has the right at any time without notice to delete or block the relevant content, and, depending on the circumstances, impose punishments that include but are not limited to warnings, restrictions or prohibitions of the use of part or all of the functions, account bannings and cancellations. The results will be made public.\" (Source 24, Section 8.5.1). \n\nIt also states, \"Users understand and agree that Tencent is entitled to punish the violation of any laws or the breach of this agreement according to the company’s reasonable judgments, to take appropriate legal actions to any user who violates the laws and regulations, and to keep related information and report to the relevant departments. In such situations, the user should bear all the legal liabilities alone.” (Source 24, Section 8.5.2)\n\nElement 3: No evidence found."}], "type": "Internet", "display": "Tencent"}, {"name": "twitter", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}], "id": "twitter", "score": "100.00", "services": [{"sources": "Source 2: Twitter Rules\nSource 10: Abusive Behavior Policy", "score": "100.00", "type": "social network", "name": "Twitter", "comments": "Element 1: Yes, the \"Twitter Rules\" document (source 2) states, \"We do not actively monitor and will not censor user content, except in limited circumstances described below,\" followed by a long list of prohibited types of content.\n\nElement 2: Yes, the Twitter Rules prohibit certain activities including spamming, impersonation and copyright violation. The documents goes further to state that, \"Your account may be suspended for Terms of Service violations if any of the above [prohibitions] is true.\" Twitter discloses that accounts used for prohibited activity may be investigated, removed from Search and terminated without notice.\n\nElement 3: Yes, the \"Twitter Rules\" document (Source 2) provides many general examples (e.g. \"You may not publish or post other people's private and confidential information, such as credit card numbers, street address or Social Security/National Identity numbers,\") there are links to other documents such as \"Abusive Behavior\" with more specific examples such as \"Users also may not make threats or promote violence against a person or group on the basis of race, ethnicity, national origin, religion, sexual orientation, gender, gender identity, age, or disability.\""}, {"sources": "Source 55: Vine Rules", "score": "100.00", "type": "video/photo", "name": "Vine", "comments": "Element 1: Yes, the \"Vine Rules\" document (source 55) states, \"There are some limitations on the type of content that may be published with Vine,\" followed by a list of prohibited types of content and activities.\n\nElement 2: Yes, following the list of prohibited content and activities in the \"Vine Rules\" document (Source 55), the company states, \"Accounts engaging in any of the activities specified above may be subject to permanent suspension.\"  \n\nElement 3: Yes, the \"Vine Rules\" (Source 55) document provide examples (e.g. \"nudity or mild violence\"), with links to more specific topics such as the \"Vine graphic content FAQ\" (Source 56) which include many more examples, e.g. \"Killing or torture of animals.\""}], "type": "Internet", "display": "Twitter"}, {"name": "vodafone", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "vodafone", "score": "66.67", "services": [{"sources": "9, 10, 33, 34, 54, 56", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: In its freedom of expression principles in its law enforcement report, Vodafone states the kinds of blocking of content (and accounts) that it will do. Specifically, the company states that blocking only occurs when: an agency or authority makes a lawful request; blocking access to illegal online child abuse material under the Internet Watch Foundation or equivalent; instructed voluntarily by the customer directly via parental controls software or other user-defined filters; or \"undertaken to protect the integrity of our customers’ data, manage traffic or prevent network degradation, for example blocking spam or malware or taking action to prevent denial of service hacker attacks.”  \n\nBy default Vodafone blocks \"18-rated content on Vodafone live! (mobile internet) and blocks access to 18-rated websites, un-moderated chat rooms and listed child abuse sites. Adult customers who want to use 18-rated services can have the content control bar lifted by proving their age.\" (Source 9). An independent classification body identifies 18-rated content in line with the standards used \"for the equivalent material in, for example, magazines, films, videos and computer games.\" (Source 10, §1). These content restrictions are partly agreed upon with other mobile UK operators, who together further  committed to address unsolicited bulk content and malicious content (Source 10, §1-5). In addition, the pay as you go TOS (Source 33, §3) identifies prohibited activities, including that, \"You must not use your mobile equipment or the services for any purpose we believe is abusive, illegal, fraudulent, a nuisance or for criminal activities.\" The pay monthly TOS (Source 34, §4) contains similar information. \n\nElement 2: As in element 1, the company explains that it blocks 18-rated content for users who haven't proven their age to be above 18. Moreover they may take down content and report inappropriate content to authorities: \"On rare occasions, unsuitable material isn’t identified by us or the content provider. When we receive a complaint, we aim to take down inappropriate content (including images and music downloads) within six hours of it coming to our attention. We also report illegal content to the police and illegal sites to the Internet Watch Foundation.\" (source 9). In addition, the pay as you go TOS (Source 33, §6) and pay monthly TOS (Source 34, §9) say the company can suspend a user's service if the user does not adhere to the agreement. \n\nElement 3: No evidence found. "}], "type": "Telecommunications", "display": "Vodafone"}, {"name": "yahoo", "levels": [{"text": "1. The company explains what types of content or activities it does not permit.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains its process for enforcing its rules.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides examples to help the user understand what the rules are and how they are enforced.", "scores": [{"score": "50", "response": "partial"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}], "id": "yahoo", "score": "94.44", "services": [{"sources": "Source 01: Yahoo TOS\nSource 02: Communications TOS\nSource 72: Yahoo Universal Anti-Spam Policy\nSource 73: Yahoo Help Center - Yahoo's Spam and Abuse Policy", "score": "83.33", "type": "mail service", "name": "Mail", "comments": "No disclosure found in the Communications TOS, but since the Yahoo TOS also apply to Mail, that disclosure is included here. \n\nElement 1: Yes, the Yahoo TOS (Source 1) section \"6. MEMBER CONDUCT\" states that, \"You agree to not use the Yahoo Services to:\" followed by a long list of forbidden types of content, including  \"Content that is unlawful, harmful, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, libelous, invasive of another's privacy, hateful, or racially, ethnically, or otherwise objectionable.\" \n\nElement 2: Yes, the end of the Yahoo TOS (Source 1) section \"6. MEMBER CONDUCT\" states that, \"Yahoo and its designees shall have the right (but not the obligation) in their sole discretion to pre-screen, refuse, or remove any Content that is available via the Yahoo Services. Without limiting the foregoing, Yahoo and its designees shall have the right to remove any Content that violates the TOS or is otherwise objectionable. You agree that you must evaluate, and bear all risks associated with, the use of any Content, including any reliance on the accuracy, completeness, or usefulness of such Content.\"\n\nElement 3: Yahoo's Universal Anti-Spam Policy (Source 72) provides a bulleted list of examples of behaviors that are considered spam. A Yahoo Help Center page on the spam and abuse policy (Source 73) provides additional types of content that are not permitted and that are also listed in the Terms of Service. For these types of content (e.g. \"Content that is unlawful, harmful, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, libelous, invasive of another's privacy, hateful, or racially, ethnically or otherwise objectionable\"), Yahoo does not provide further examples. Given that the examples are only made available for behaviors that are considered spam, a 'partial' score is awarded."}, {"sources": "Source 01: Yahoo TOS\nSource 04: Flickr Community Guidelines\nSource 70: Flickr Help FAQ Content filters", "score": "100.00", "type": "video/photo", "name": "Flickr", "comments": "Element 1: Yes, the Flickr Community Guidelines (Source 4) has a section \"Things not to do,\" which explains what is not permitted. In addition, the Yahoo TOS section \"6. MEMBER CONDUCT\" states that, \"You agree to not use the Yahoo Services to:\" followed by a long list of forbidden types of content, including  \"Content that is unlawful, harmful, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, libelous, invasive of another's privacy, hateful, or racially, ethnically, or otherwise objectionable.\"\n\nElement 2: Yes, the Flickr Community Guidelines says, \"We like to give second chances. However, when we discover you stepping across any of the lines listed below, we will take action, which may mean deleting your account with or without warning.\" In addition, the end of the Yahoo TOS (Source 1) section \"6. MEMBER CONDUCT\" states that, \"Yahoo and its designees shall have the right (but not the obligation) in their sole discretion to pre-screen, refuse, or remove  any Content that is available via the Yahoo Services. Without limiting the foregoing, Yahoo and its designees shall have the right to remove any Content that violates the TOS or is otherwise objectionable. You agree that you must evaluate, and bear all risks associated with, the use of any Content, including any reliance on the accuracy, completeness, or usefulness of such Content.\"\n\nElement 3: Flickr's Community Guidelines (Source 4) provide specific examples of types of content that is not allowed (e.g.: \"Don't upload anything that isn't yours. This includes other people's photos, video, and/or stuff you've copied or collected from around the Internet.\"). In addition, the Flickr Help/FAQ page on content filters (Source 70) provides examples to help users differentiate between safe, moderate, and restricted content (which is under user control). For example, the section on \"1. Safety Level\" states, \"A good rule of thumb is, bare breasts and bottoms are 'moderate.' Full frontal nudity is 'restricted.'\" The section on \"2. Content Type\" states, \"For example, if you want to upload a screenshot of a web page or an online game, you can, but you need to flag it as a screenshot.\""}, {"sources": "Source 5: Tumblr Community Guidelines", "score": "100.00", "type": "blog", "name": "Tumblr", "comments": "Element 1: Yes, the Tumblr Community Guidelines (Source 5) has a section \"What Tumblr is not for:\" which has a list of types of prohibited content and activities.\n\nElement 2: Yes, the Tumblr Community Guidelines (Source 5) says: \"If we conclude that you are violating these guidelines, you may receive a notice via email. If you don't explain or correct your behavior, we may take action against your account. We do our best to ensure fair outcomes, but in all cases we reserve the right to suspend accounts, or remove content, without notice, for any reason, but particularly to protect our services, infrastructure, users, and community. We reserve the right to enforce, or not enforce, these guidelines in our sole discretion, and these guidelines don't create a duty or contractual obligation for us to act in any particular manner.\"\n\nElement 3: Yes, the Tumblr Community Guidelines (Source 5) provide examples. For example, \"Don't post content that actively promotes or glorifies self-harm. This includes content that urges or encourages others to: cut or injure themselves; embrace anorexia, bulimia, or other eating disorders; or commit suicide rather than, e.g., seeking counseling or treatment, or joining together in supportive conversation with those suffering or recovering from depression or other conditions.\""}], "type": "Internet", "display": "Yahoo"}], "id": "F3", "name": "F3. Reasons for content restriction "}