{"follow": 0, "companies": [{"name": "americaMovil", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "americamovil", "score": "33.33", "services": [{"sources": "14, 17, 18", "score": "33.33", "type": "", "name": "Mobile", "comments": "Element 1: In its Service Delivery Agreement and its Code of Business Practices Telcel lists the reasons why it would suspend a user's service (source 14, p. 11-12, DÉCIMO OCTAVA.­ SUSPENSIÓN DE LOS SERVICIOS; source 17, p. 80). The Service Delivery Agreement also enumerates the reasons why Telcel would terminate a user's contract (source 14, p. 13 VIGÉSIMO PRIMERA.­ TERMINACIÓN DEL CONTRATO).\n\nElement 2: In its Service Delivery Agreement Telcel states that it will compensate users whose service is interrupted (source 14, p. 11, DÉCIMO SÉPTIMA.­ INTERRUPCIÓN DE LOS SERVICIOS). It also provides a list of situations in which Telcel will not compensate users for an interruption in service. However, it does not specify why the company itself would shut down or restrict access to the service, and does not reference the possibility of a government entity requiring such an interruption. Although it references \"artículo 81 del Reglamento de Telecomunicaciones\", this regulation does not allude to the possibility of a government authority requiring a shutdown either (source 18 p. 20). In addition, the company’s Code of Business Practices provides that Telcel will compensate users whose service is interrupted, but does not provide details about when the company would shut down or restrict access to the service (source 17 p. 81, \"INTERRUPCIÓN DEL SERVICIO\"). \n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "America Movil"}, {"name": "at&t", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "att", "score": "66.67", "services": [{"sources": "1, 3, 5, and 17", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: AT&T's Copyright/Trademark Claims policy says it will terminate, \"subscribers and account holders who are repeat infringers of copyrighted works, trademarks or any other intellectual property.\" The AUP, section \"AUP Enforcement and Notice\" paragraphs 1-2 explain that if a customer fails to follow the AUP guidelines, AT&T may take, \"actions anywhere from a warning to a suspension or termination of Customer's IP Services.\" The postpaid ToS, section 1.2 provides a bulleted list of situations in which, \"AT&T may interrupt, suspend or cancel your Services and terminate your Agreement without advance notice for any reason.\" Section 4.5 explains situations in which AT&T may terminate users' voice, data, and messaging services. Section 4.6.1.3 says \"AT&T, in its sole discretion, may block your ability to use your Device while roaming internationally until eligibility criteria are met.\" Section 5.4 paragraph 2 says AT&T may terminate voice service if users engage in any of the listed prohibited activities. Section 6.2, in the paragraph titled \"AT&T's Rights to Ensure Compliance\" says, \"AT&T may interrupt, suspend, cancel or terminate your wireless data services without advance notice.\" Section 6.5 paragraph 7 says the company may \"deny, disconnect, suspend, modify and/or terminate your messaging service\" if a user engages in the listed prohibited activities. Section 6.10 says, \"We may, at our discretion, suspend your account if we believe your data usage is excessive, unusual or is better suited to another rate plan.\" The prepaid ToS (source 3), in the section titled \"Data\", paragraph 4 says, \"If you use wireless data services in any manner that is prohibited....(e) we may interrupt, suspend, cancel, or terminate your wireless data services without advance notice.\" In the section titled \"Text, Picture/Video Messaging and Instant Messaging,\" paragraph 2, says AT&T may \"deny, disconnect, suspend, modify, and/or terminate your messaging service.\" The section on \"Termination\" also explains situations in which AT&T may terminate prepaid services. \nThe AUP contains the following language: \"Customer's failure to observe the guidelines set forth in this AUP may result in AT&T taking actions anywhere from a warning to a suspension or termination of Customer's IP Services. When feasible, AT&T may provide Customer with a notice of an AUP violation via e-mail or otherwise allowing the Customer to promptly correct such violation.\"\n\"AT&T reserves the right, however, to act immediately and without notice to suspend or terminate affected IP Services in response to a court order or government notice that certain conduct must be stopped or when AT&T reasonably determines, that the conduct may: (1) expose AT&T to sanctions, prosecution, civil action or any other liability, (2) cause harm to or interfere with the integrity or normal operations of AT&T's network or networks with which AT&T is interconnected, (3) interfere with another AT&T Customer's use of IP Services or the Internet (4) violate any applicable law, rule or regulation, or (5) otherwise present an imminent risk of harm to AT&T or AT&T Customers.\"\n\nElement 2: The postpaid ToS, section 4.1, paragraph 1 explains reasons why service \"may be interrupted, delayed, or otherwise limited.\" This includes \"priority access by National Security and Emergency Preparedness personnel in the event of a disaster or emergency.\" The prepaid ToS paragraph titled \"Limitation of Liability\" also includes the same language. \n\nElement 3: There is no evidence that AT&T provides clear examples of situations why it may restrict a user’s account or where it may restrict provision of service to particular area or group of users."}, {"sources": "5, 6, and 17", "score": "66.67", "type": "", "name": "Fixed Broadband", "comments": "Element 1: AT&T's Copyright/Trademark Claims policy says it will terminate, \"subscribers and account holders who are repeat infringers of copyrighted works, trademarks or any other intellectual property.\" The AUP, section \"AUP Enforcement and Notice\" paragraphs 1-2 explain that if a customer fails to follow the AUP guidelines, AT&T may take, \"actions anywhere from a warning to a suspension or termination of Customer's IP Services.\" The Internet ToS Section 2.e says AT&T may discontinue DSL service in an area that gains U-Verse service and switch users to a U-Verse plan. Section 5.b explains the situations in which AT&T may \"immediately terminate or suspend\" account access. Section 5.c says AT&T may terminate high speed internet service if a user cancels AT&T local wireline voice service. Section 6.f says \"AT&T may suspend or terminate Service if your payment is past due.\" Section 7.a paragraph 5 says \"Failure to provide notice to AT&T of theft in a timely manner may result in the termination of your Services.\" \nThe AUP contains the following language: \"Customer's failure to observe the guidelines set forth in this AUP may result in AT&T taking actions anywhere from a warning to a suspension or termination of Customer's IP Services. When feasible, AT&T may provide Customer with a notice of an AUP violation via e-mail or otherwise allowing the Customer to promptly correct such violation.\"\n\"AT&T reserves the right, however, to act immediately and without notice to suspend or terminate affected IP Services in response to a court order or government notice that certain conduct must be stopped or when AT&T reasonably determines, that the conduct may: (1) expose AT&T to sanctions, prosecution, civil action or any other liability, (2) cause harm to or interfere with the integrity or normal operations of AT&T's network or networks with which AT&T is interconnected, (3) interfere with another AT&T Customer's use of IP Services or the Internet (4) violate any applicable law, rule or regulation, or (5) otherwise present an imminent risk of harm to AT&T or AT&T Customers.\"\n\nElement 2: The Internet ToS section 16 say that AT&T is \"not liable for any failure of performance due to any cause beyond their reasonable control including...request by any government, civil or military authority, or suspension of existing service in compliance with state and/or federal law, rules and regulations.\" AT&T mentions the possibility of network failure, but gives no explanation of why or when this could happen. \n\nThe company's high-speed Internet TOS also covers service restrictions occuring under \"force majeure\", which establishes that service may be interrupted under circumstances beyond AT&T's control including \"acts of God, fire, explosion, vandalism, terrorism, cable cut, major weather disturbance, national emergencies, riots, wars, labor difficulties, supplier failures, shortages, breaches, any law, order, regulation, direction, action, or request by any government, civil or military authority, or suspension of existing service in compliance with state and/or federal law, rules and regulations, or delays caused by you or your equipment\".\n\nElement 3: There is no evidence that AT&T provides clear examples of situations why it may restrict a user’s account or where it may restrict provision of service to particular area or group of users."}], "type": "Telecommunications", "display": "AT&T"}, {"name": "axiata", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "100", "response": "yes"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "axiata", "score": "66.67", "services": [{"sources": "15", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: The General TOS (Source 15, Section A, 22.2) states, \"Celcom shall be entitled at its absolute discretion to immediately  suspend/terminate the Services or Agreement, without liability, at any time, without any notice and may not be required to give any reason whatsoever, including but not limited to the following reasons:\" and provides a list of reasons: \"If any technical failure occurs in the Services or Celcom’s System; While the Service is being upgraded, modified or maintained; If you breach any of the Terms and Conditions;  If you do anything which may in Celcom's opinion, lead to, including but not limited to damage  to the Services and/or Celcom’s System or losses to Celcom; If Celcom is required to comply with an order, instruction or request of regulatory authority, government authority or any other competent authority; or If it is in Celcom's opinion that the Service or Celcom’s System is or may be used fraudulently, illegally or for unlawful purposes.\"\n\nElement 2: The General TOS (Source 15, Section A, 22.2e) states that Celcom may suspend or terminate access to the service \"If Celcom is required to comply with an order, instruction or request of regulatory authority, government authority or any other competent authority.\"\n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "Axiata"}, {"name": "bhartiAirtel", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "50", "response": "partial"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "bhartiairtel", "score": "58.33", "services": [{"sources": "1,2,10", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: The Telecom Charter (Source 10) identifies a number of instances upon which a user's account for pre-paid services may be restricted or shut down: Page 5: \"Service to this SIM card will be discontinued if there is no usage, i.e., a voice call/video call (incoming or outgoing) or an outgoing SMS or a data usage or usage of Value Added Services, or payment of rental (in case of postpaid connection) etc. for a continuous period of 90 days with a grace period of fifteen days for reactivation.\" Page 9: \"Bharti Airtel Limited reserves the right to temporarily/permanently make any or all network resources unavailable due to technical reasons, for upgrade of network, for repair of network or for reasons of commercial unavailability and the Customer shall have no claim against Bharti Airtel Limited with respect to the same. Bharti Airtel Limited reserves the right to terminate the subscription of any Customer who is not competent to enter into any contract under the Indian Contract Act, 1872.... Service quality, functionality, availability and/or reliability may be affected, and/or/Bharti Airtel Limited is entitled to, without any liability whatsoever to refuse, limit, suspend, vary or disconnect the service, in whole or in part, at any time, in its sole discretion, with respect to one/all customers without any notice, for any reason which is found to be reasonable by Bharti Airtel Limited, including, but not limited to the following: Government’s, TRAI’s rules, regulations, orders, directions, notifications etc., including changes there to prohibiting and/or suspending the rendering of such Service. Transmission limitation caused by topographical, geographical, atmospheric, hydrological and or mechanical conditions. During technical failure, modification, upgradation or variation, relocation, repair and/or maintenance of the systems/equipments. To combat potential fraud, sabotage, willful destruction, etc. If service is used in any manner, which violates any law etc. or adversely affects or interferes in any manner, the rendering of service by Bharti Airtel Limited. Any other reason, which is found to be reasonable by Bharti Airtel Limited warranting suspension/disconnection. Force majeure circumstances (i.e., acts of God.)\" The website pre-paid ToS (Source 2) also state, \"AIRTEL reserves the right to disconnect any Airtel Prepaid connection at any stage, without any prior notification, in case of non-fulfillment of formalities or in case wrong/inaccurate information is furnished by the customer.\"  Regarding post-paid services, the Telecom Charter (p. 14, section 2) states a number of instances upon which a user's account may be restricted, the service may be restricted or shut down. Additionally the website ToS for post-paid services (Source 1) state, \"Delay in payment of your billed/outstanding amount may lead to disconnection of the Customer's AIRTEL services, in part or whole, effective from the day falling immediately after due date at the sole discretion of AIRTEL.\"\n\nElement 2: yes"}, {"sources": "10", "score": "50", "type": "", "name": "Fixed Broadband", "comments": "Element 1: Regarding fixed-line services, the Telecom Charter (p. 14, section 2) states a number of instances upon which a user's account may be restricted, the service may be restricted or shut down. However, it also states, \"Airtel, without any liability, whatsoever, is entitled to refuse, limit, suspend, vary or disconnect the Services at any time, for any reasonable cause, including, but not limited, to the following:\" This vague disclosure means that the company does not meet the requirements for \"Yes,\" but it receives partial credit.\n\nElement 2: The Telecom Charter's ToS for fixedline services (Source 10, p. 15, section 2e) states that Airtel may suspend service, \"To combat potential fraud, sabotage, willful destruction, national security or for any other force majeure reasons etc.\"\n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "Bharti Airtel"}, {"name": "etisalat", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "etisalat", "score": "50.00", "services": [{"sources": "3, 4, 6, 7", "score": "33.33", "type": "", "name": "Mobile", "comments": "Element 1: Etisalat's ToS for prepaid mobile services (Sources 4 and 7, Section 8) and TOS for postpaid mobile services (Sources 3 and 6, Section 6) state that Etisalat reserves the right to suspend, disconnect or terminate one or more services provided to a specific customer for a number of reasons including:  \n1) use profane language or fraudulent or malicious use of the telecommunications system in a manner prohibited by law; \n2) violation of the Terms and Conditions \n3) violation of the laws of the UAE, to further a criminal purpose, or infringe the rights including intellectual property rights of Etisalat\nor any third party and \n4) circulation of material deemed contrary to, public morality, abusive, offensive, indecent, defamatory, obscene or menacing, or in breach, of any intellectual property rights, confidence privacy or any other rights or which is liable to incite racial disharmony or hatred, or which comprises a virus or other code liable to cause loss or damage. \n\nElement 2: No evidence found.\n\nElement 3: No evidence found."}, {"sources": "2 and 17", "score": "66.67", "type": "", "name": "Fixed Broadband", "comments": "Element 1: The eLife TOS (Arabic-Source 2; English-Source 17) section 14a on \"Disconnection,  Termination and claiming compensation by Etisalat,\" provides a list of reasons why it may restrict a user's account.\n\nElement 2: The eLife TOS section 14c states, \"Notwithstanding the above, Etisalat may suspend, disconnect or terminate the use of one or more services, with or without notice and without exposing itself to any liability, at any time, in the event that Etisalat is required to do so under any applicable laws or regulations, or under any other regulatory requirements, or upon request by Government or regulatory or security or other competent authorities.\"\n\nElement 3: No evidence found."}], "type": "Telecommunications", "display": "Etisalat"}, {"name": "facebook", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "facebook", "score": "33.33", "services": [{"sources": "2,3", "score": "50.00", "type": "social network", "name": "Facebook", "comments": "Element 1: In its \"Rights and Responsibilities\" document, Facebook states, \"If you violate the letter or spirit of this Statement, or otherwise create risk or possible legal exposure for us, we can stop providing all or part of Facebook to you. We will notify you by email or at the next time you attempt to access your account.\"(Source 2, section 14) Although the clause \"otherwise create risk or possible legal exposure for us\" is overly broad, the community standards (Source 3) state, \"The consequences for violating our Community Standards vary depending on the severity of the violation and the person's history on Facebook. For instance, we may warn someone for a first violation, but if we continue to see further violations we may restrict a person's ability to post on Facebook or ban the person from Facebook.\" Since the community standards are fairly detailed, the company receives credit on this element.\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: While the \"Community Standards\" (Source 3) document is fairly clear on what types of content and behavior are prohibited (which is evaluated in F3), the company does not provide specific examples of what situations that would trigger account restriction."}, {"sources": "4", "score": "0.00", "type": "IM & calls", "name": "Whatsapp", "comments": "Element 1: \"Whatsapp Legal\" document (Source 4) states that, \"WhatsApp may also terminate a user's access to the Service, if they are determined to be a repeat infringer, or for any or no reason, including being annoying.\" This is too broad and vague to be awarded credit under this element.\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found."}, {"sources": "5,7,8", "score": "50.00", "type": "social network", "name": "Instagram", "comments": "Element 1: The Instagram Terms (Source 5), section on \"General Conditions\" states, \"We reserve the right to modify or terminate the Service or your access to the Service for any reason, without notice, at any time, and without liability to you.” The Instagram Terms (Source 5), section on \"Reporting Copyright and Other IP Violations\" states, \"If you repeatedly infringe other people's intellectual property rights, we will disable your account when appropriate.\" The community guidelines (Source 7) states, \"Overstepping these boundaries may result in a disabled account.\" The \"Instagram Account Disabled” page (source 8), states, \"Accounts that don't follow our Community Guidelines or Terms of Use may be disabled without warning.\" Since the community guidelines are fairly detailed, the company receives credit on this element.\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: While the community guidelines (Source 7) document is fairly clear on what types of content and behavior are prohibited (which is evaluated in F3), the company does not provide specific examples of what situations that would trigger account restriction."}], "type": "Internet", "display": "Facebook"}, {"name": "google", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "100", "response": "yes"}]}], "id": "google", "score": "75.00", "services": [{"sources": "1, 105", "score": "N/A", "type": "search engine", "name": "Search", "comments": "Element 1: This element is deemed N/A for search engines since users do not need an account to use the service.\n\nElement 2: This element is N/A for Internet companies\n\nElement 3: This element is deemed N/A for search engines since users do not need an account to use the service."}, {"sources": "Source 19: Gmail Account Locked; 118: Google Product Policy (Gmail)", "score": "50.00", "type": "mail service", "name": "Gmail", "comments": "Element 1: The Gmail product policy (Source 118) provides a list of prohibited activities or content and states, \"Google may disable accounts that are found to be in violation of these policies.”\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found."}, {"sources": "Source 3: YouTube TOS, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14", "score": "100.00", "type": "video/photo", "name": "Youtube", "comments": "Element 1: Yes, the YouTube TOS (Source 3) Section 7 on Account Termination Policy states, \"YouTube will terminate a user's access to the Service if, under appropriate circumstances, the user is determined to be a repeat infringer. YouTube reserves the right to decide whether Content violates these Terms of Service for reasons other than copyright infringement, such as, but not limited to, pornography, obscenity, or excessive length. YouTube may at any time, without prior notice and in its sole discretion, remove such Content and/or terminate a user's account for submitting such material in violation of these Terms of Service.\"\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: Yes, in its Community Guidelines (Source 4) and underlying pages (Sources 6 through 14) YouTube provides detailed examples."}], "type": "Internet", "display": "Google"}, {"name": "kakao", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}], "id": "kakao", "score": "100.00", "services": [{"sources": "6", "score": "N/A", "type": "search engine", "name": "Daum Search", "comments": "Element 1: This element is deemed N/A for search engines since users do not need an account to use the service. However, it is noted that the researcher found that: In its ToS, the company describes six cases where it may restrict or terminate members' use of the service. (Article 11 paragraph 1 of source 6). The company further states that if a member commits any of the prohibited activities specified in the first paragraph of Article 11, it may delete or temporarily obscure relevant postings, restrict the member's use of service, or terminate the contract unilaterally. (Article 13 paragraph 2 of source 6).\n\nElement 2: This element is N/A for Internet companies\n\nElement 3: This element is deemed N/A for search engines since users do not need an account to use the service."}, {"sources": "6, 47", "score": "100.00", "type": "mail service", "name": "Daum Mail", "comments": "Element 1: In its ToS, the company describes six cases where it may restrict or terminate members' use of the service. (Article 11 paragraph 1 of source 6). The company further states that if a member commits any of the prohibited activities specified in the first paragraph of Article 13, it may delete or temporarily obscure relevant postings, restrict the member's use of service, or terminate the contract unilaterally. (Article 13 paragraph 2 of source 6). Furthermore, Daum maintains an anti-spam policy (Source 47) and outlines what kinds of behaviors in does not allow under that policy.\n\nElement 2: This element is N/A for Internet companies\n\nElement 3: The prohibited activities listed in Article 13, § 1 of the ToS (Source 6) are complemented by examples. The anti-spam policy (Source 47) under paragraph 5, provides further detailed examples of what constitutes spam."}, {"sources": "5,8", "score": "100.00", "type": "IM & calls", "name": "Kakaotalk", "comments": "Element 1: In its ToS, the company states, \"[i]f you fail to comply with the applicable laws, the Terms of Service and/or other policies of Daum Kakao, Daum Kakao may conduct an investigation into the matter or suspend your use of the Services either temporarily or permanently.” (Source 5). The ToS then refers to the Operating Policy, which provides that the company may impose temporary or permanent service restrictions on users who engage in prohibited activities, of which a list is included, without prior notice. (Source 8).\n\nElement 2: This element is N/A for Internet companies\n\nElement 3: In its Operating Policy (Source 8) Kakao includes examples of the types of activities that are prohibited."}], "type": "Internet", "display": "Kakao"}, {"name": "mailRu", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "mailru", "score": "50.00", "services": [{"sources": "4", "score": "50.00", "type": "social network", "name": "Vkontakte", "comments": "Element 1: In its ToS, Vk enumerates various reasons why it may restrict a user’s account (section 6.3, 7.22 and 8.6, source 4).\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found."}, {"sources": "8", "score": "50.00", "type": "mail service", "name": "Mail", "comments": "Element 1: In its ToS, Mail.Ru outlines its reasons for terminating user accounts- breach of terms, government request, extended period of non-use, security and technical concerns (section 8.2, source 8). The ToS also states that it may restrict access without providing users with reasons (8.3 & 8.4, source 8).\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found."}, {"sources": "8", "score": "50.00", "type": "", "name": "Mail.ru Agent", "comments": "Element 1: In its ToS, Mail.Ru outlines its reasons for terminating user accounts- breach of terms, government request, extended period of non-use, security and technical concerns (section 8.2, source 8). The ToS also states that it may restrict access without providing users with reasons (8.3 & 8.4, source 8).\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found. "}], "type": "Internet", "display": "Mail.Ru"}, {"name": "microsoft", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}], "id": "microsoft", "score": "100.00", "services": [{"sources": "Source 02: Microsoft Services Agreement", "score": "N/A", "type": "search engine", "name": "Bing", "comments": "Element 1: This element is deemed N/A for search engines since users do not need an account to use the service.\n\nElement 2: This element is N/A for Internet companies\n\nElement 3: This element is deemed N/A for search engines since users do not need an account to use the service."}, {"sources": "Source 02: Microsoft Services Agreement", "score": "100.00", "type": "mail service", "name": "Outlook.com", "comments": "Element 1: The Microsoft Services Agreement (Source 2) Section 3a provides a list of prohibited activities, and section 3b states, \"Enforcement. If you violate these Terms, we may stop providing Services to you or we may close your Microsoft account or Skype account.\" Section 4(a)(ii) provides further information on situations where the company may restrict a user's account: \"If you don’t sign in during this time, we will assume your Microsoft account is inactive and will close it for you. Please see section 4(a)(iv)(2) for the consequences of a closed Microsoft account. You must sign into your Outlook.com inbox and your OneDrive (separately) at least once in a one-year period, otherwise we will close your Outlook.com inbox and your OneDrive for you. If we reasonably suspect that your Microsoft account or Skype account is being used by a third party fraudulently (for example, as a result of an account compromise), Microsoft may suspend your account until you can reclaim ownership. If you are having trouble accessing your Microsoft account, please visit this website: http://go.microsoft.com/fwlink/?LinkId=238656. To manage your Skype account, you must \"Sign In\" at www.skype.com.\" \n\nElement 2: This element is N/A for Internet companies\n\nElement 3: The Microsoft Services Agreement (Source 2) provides examples of situations that may trigger account restriction. Section 4(a)(ii) states, \"You must sign into your Outlook.com inbox and your OneDrive (separately) at least once in a one-year period, otherwise we will close your Outlook.com inbox and your OneDrive for you. If we reasonably suspect that your Microsoft account or Skype account is being used by a third party fraudulently (for example, as a result of an account compromise), Microsoft may suspend your account until you can reclaim ownership.\""}, {"sources": "Source 02: Microsoft Services Agreement", "score": "100.00", "type": "IM & calls", "name": "Skype", "comments": "Element 1: The Microsoft Services Agreement (Source 2) Section 3a provides a list of prohibited activities, and section 3b states, \"Enforcement. If you violate these Terms, we may stop providing Services to you or we may close your Microsoft account or Skype account.\" Section 4(a)(ii) provides further information on situations where the company may restrict a user's account: \"If you don’t sign in during this time, we will assume your Microsoft account is inactive and will close it for you. Please see section 4(a)(iv)(2) for the consequences of a closed Microsoft account. You must sign into your Outlook.com inbox and your OneDrive (separately) at least once in a one-year period, otherwise we will close your Outlook.com inbox and your OneDrive for you. If we reasonably suspect that your Microsoft account or Skype account is being used by a third party fraudulently (for example, as a result of an account compromise), Microsoft may suspend your account until you can reclaim ownership. If you are having trouble accessing your Microsoft account, please visit this website: http://go.microsoft.com/fwlink/?LinkId=238656. To manage your Skype account, you must \"Sign In\" at www.skype.com.\" \n\nElement 2: This element is N/A for Internet companies\n\nElement 3: The Microsoft Services Agreement (Source 2) provides examples of situations that may trigger account restriction. Section 4(a)(ii) states, \"You must sign into your Outlook.com inbox and your OneDrive (separately) at least once in a one-year period, otherwise we will close your Outlook.com inbox and your OneDrive for you. If we reasonably suspect that your Microsoft account or Skype account is being used by a third party fraudulently (for example, as a result of an account compromise), Microsoft may suspend your account until you can reclaim ownership.\""}], "type": "Internet", "display": "Microsoft"}, {"name": "mtn", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "50", "response": "partial"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "mtn", "score": "50.00", "services": [{"sources": "Source 2, Section 13\nSource 3, Section 10.2, 10.7, and 10.9", "score": "50.00", "type": "", "name": "Mobile", "comments": "Element 1: The short subscriber agreement (Source 2) Section 13 and the standard subscriber agreement (Source 3) Sections 7.6, 10.2, 10.7, and 10.9 list the reasons why MTN may suspend a user's access to the service. \n\nElement 2: Partial credit for country & service level based on the fact that there is group disclosure, but it is not clear to what extent is applies downwards. MTN's \"ICT Human Rights\" page (Source 20) section on \"Policy, governance, risk management and stakeholder engagement,\" says, \"In some countries, the probability of human rights-related events may be higher than in others. The Group therefore ensures that the management team of each country maintains discretion on context-specific mitigation and management responses. In-country national emergency response teams or similar cross-functional teams comprising divisional heads and the CEO manage human rights matters and  emergency situations, e.g. requests for service shutdowns. Operating protocols specific to the situation will immediately be initiated, e.g.  requests for shutting down communication networks will require formal directives under law, or reference to specific licence conditions, as part of the review process undertaken by these teams. The country CEO will also alert designated Group executive committee members regarding emergency or crisis matters.\" MTN's \"ICT Human Rights\" page (Source 20) section on \"Policy, governance, risk management and stakeholder engagement,\" says, \"In some countries, the probability of human rights-related events may be higher than in others. The Group therefore ensures that the management team of each country maintains discretion on context-specific mitigation and management responses. In-country national emergency response teams or similar cross-functional teams comprising divisional heads and the CEO manage human rights matters and  emergency situations, e.g. requests for service shutdowns. Operating protocols specific to the situation will immediately be initiated, e.g.  requests for shutting down communication networks will require formal directives under law, or reference to specific licence conditions, as part of the review process undertaken by these teams. The country CEO will also alert designated Group executive committee members regarding emergency or crisis matters.\"\n\nThis states that the company may shut down access to the service under, \"formal directives under law, or reference to specific licence conditions.\"\n\nElement 3: The agreements do not provide specific examples of situations that may trigger restriction or denial of service by the company."}], "type": "Telecommunications", "display": "MTN"}, {"name": "orange", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "orange", "score": "66.67", "services": [{"sources": "2 (articles 12.1, 12.3 and 15)", "score": "66.67", "type": "", "name": "Mobile", "comments": "Element 1: Article 15 of the General Conditions addresses actively restricting a user's account. Orange explains instances where it may restrict or terminate users' services/contracts. These include: non-payment, non-respect by the client of his/her obligations under the contract, use of a stolen mobile phone, or for reasons related to 'public order, national defense, or public security'. In the last-mentioned case Orange may suspend the line with or without notice or ask the client not to use his line temporarily.\n\nElement 2: Article 12 of the General Conditions covers exclusion of liability for service disruptions and legal prohibitions on the provision of telecommunications services. Under section 12.1 of the General conditions of subscription to Orange mobile, Orange France 'shall take the necessary measures to continuously maintain a quality service'. However, the company states it cannot be held liable for such responsibility in a number of cases including service interruptions due to a technical incident, termination of a contract between Orange and another foreign company or due to an event of 'force majeure as recognized by the jurisprudence of the Cassation court\". Force majeure refers to when an event is unpreventable and unforeseeable, and Orange adds that this will be determined by the Cassation Court, effectively the superior courts in France.\n\nElement 3: There is no evidence that Orange provides clear examples of situations why it may restrict a user’s account or where it may restrict provision of service to particular area or group of users."}, {"sources": "1 (articles 11.2, 12.1, 13, 15). 12 (article 9). 13 (article 13.2),  14 (article 10.2), 15 (article 12), 16 (article 15)", "score": "66.67", "type": "", "name": "Fixed Broadband", "comments": "Element 1: In its subscription conditions for different broadband offers, Orange France provides reasons why it may suspend or terminate its fixed services for a specific user. These reasons include: 1) non-payment of a bill 12 days after the due date, 2) non respect of obligations stated in the contract, 3) provision of erroneous personal information to Orange and failure to inform the company within 15 days after their first contact, 4) an unusual increase in consumption, 5) piracy & violation of copyright law, 6) use considered harmful to others or contrary to public order and morals.\n\nElement 2: The company provides information as to when it may shut down or restrict service to a particular group or area. Some of these conditions speak of events of 'force majeure', as defined under French jurisprudence under the Cassation court, under which the company is no longer responsible to ensure \"the efficient functioning of the network and the telephony service'. These 'force majeure' events include natural disasters...and 'legal restrictions to the provision of telecommunication services'. The document does not define these restrictions nor list its consequences beyond the potential for service restrictions. Orange specifies that force majeure is to be understood in the meaning given by the jurisprudence of the Court of Cassation. \n\nElement 3: There is no evidence that Orange provides clear examples of situations why it may restrict a user’s account or where it may restrict provision of service to particular area or group of users."}], "type": "Telecommunications", "display": "Orange"}, {"name": "tencent", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "tencent", "score": "50.00", "services": [{"sources": "10", "score": "50.00", "type": "social network", "name": "Qzone", "comments": "Element 1: The Qzone ToS states that the company may impose restrictions on users’ accounts when it discovers or receives reports of violations of the ToS. (Source 10, section 7.1 and 7.2)\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found."}, {"sources": "8", "score": "50.00", "type": "IM & calls", "name": "Qq", "comments": "Element 1: In the QQ Software License and Service Agreement Tencent explains that it may impose restrictions on users’ accounts when it discovers or receives reports of violations of the Agreement. (Source 8, Section 8.2 and 8.5)\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found."}, {"sources": "24", "score": "50.00", "type": "IM & calls", "name": "Wechat", "comments": "Element 1: In WeChat's Software License And Service Agreement, Tencent explains that it may impose restrictions on users’ accounts when it discovers or receives reports of violations of the Agreement. (Source 24, Sections 8.1 and 8.5)\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No evidence found."}], "type": "Internet", "display": "Tencent"}, {"name": "twitter", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}], "id": "twitter", "score": "100.00", "services": [{"sources": "Source 2: Twitter Rules\nSource 10: Abusive Behavior Policy", "score": "100.00", "type": "social network", "name": "Twitter", "comments": "Element 1: The Twitter ToS (Source 1) section 8 states, \"We reserve the right at all times (but will not have an obligation) to remove or refuse to distribute any Content on the Services, to suspend or terminate users, and to reclaim usernames without liability to you.\" The \"Twitter Rules\" document (Source 2) provides more detail. It contains a list of prohibited content and activities and states, \"Your account may be suspended for Terms of Service violations if any of the above is true.\" \n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: Yes, the \"Twitter Rules\" document (Source 2) provides many general examples (e.g. \"You may not publish or post other people's private and confidential information, such as credit card numbers, street address or Social Security/National Identity numbers,\") there are links to other documents such as \"Abusive Behavior\" with more specific examples such as \"Users also may not make threats or promote violence against a person or group on the basis of race, ethnicity, national origin, religion, sexual orientation, gender, gender identity, age, or disability.\""}, {"sources": "Source 55: Vine Rules", "score": "100.00", "type": "video/photo", "name": "Vine", "comments": "Element 1: The Vine ToS (Source 54), section 8 states, \"We reserve the right at all times (but will not have an obligation) to remove or refuse to distribute any Content on the Services, to suspend or terminate users, and to reclaim usernames and profile URLs without liability to you.\" The \"Vine Rules\" document (source 55) provides more detail. It contains a list of prohibited content and activities and states, \"Accounts engaging in any of the activities specified above may be subject to permanent suspension.\"\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: Yes, there are general examples in the \"Vine Rules\" (Source 55) document (e.g. \"Spam and Abuse\"), with subsections related to more specific cases such as \"Serial Accounts: You may not create serial accounts for disruptive or abusive purposes, or with overlapping use cases. Mass account creation may result in suspension of all related accounts.\""}], "type": "Internet", "display": "Twitter"}, {"name": "vodafone", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "100", "response": "yes"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "50", "response": "partial"}]}], "id": "vodafone", "score": "83.33", "services": [{"sources": "14, 33, 34", "score": "83.33", "type": "", "name": "Mobile", "comments": "Element 1: The pay as you go TOS (Source 33, section 6) and pay monthly TOS (Source 34, section 9) list the reasons why the company may suspend a user's account.\n\nElement 2: In its Law Enforcement Disclosure Report and supplementary Legal Annexe, Vodafone explains that it may be required to restrict service as a result of state regulations or other order. The Legal Annexe explains the laws/regulations and under which a network shutdown could occur in the UK (Source 14, p. 105-106, § Shut-down of network and services,\" \"Power to take control of Vodafone’s network,\" and \"Oversight of the use of powers\"). \n\nElement 3: In its Law Enforcement Disclosure Report (source 54, p. 14, § Emergency or crisis powers), Vodafone explains that service restricitons it may be required to comply with result from four basic legal requirements:  national security powers, IP/URL content blocking and filtering, takedown of service, or emergency or crisis powers. The company provided the Egyptian example and links to more information about the Egyptian case to further show how these legal powers could be employed. Its legal annexe adds details on the legal context in its various operating countries and the various laws and regulations that might require Vodafone to restrict service. However, Vodafone's disclosure does not provide examples as to why a user's account may be restricted. As such, the company receives partial credit. "}], "type": "Telecommunications", "display": "Vodafone"}, {"name": "yahoo", "levels": [{"text": "1. The company explains the reason(s) why it may restrict a user’s account.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}]}, {"text": "2. The company explains why it may shut down or restrict service to a particular area or group of users (where applicable).", "scores": [{"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}, {"score": "N/A", "response": "N/A"}]}, {"text": "3. The company provides specific examples of situations that may trigger restriction or denial of service by the company.", "scores": [{"score": "100", "response": "yes"}, {"score": "100", "response": "yes"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "yahoo", "score": "83.33", "services": [{"sources": "Source 01: Yahoo TOS\nSource 02: Communications TOS\nSource 57: Yahoo Community Guidelines", "score": "100.00", "type": "mail service", "name": "Mail", "comments": "Element 1: Yes, the Yahoo TOS (Source 1), Section \"3. YOUR REGISTRATION OBLIGATIONS\", states that, \"If you provide any information that is untrue, inaccurate, not current or incomplete, or Yahoo has reasonable grounds to suspect that such information is untrue, inaccurate, not current or incomplete, Yahoo has the right to suspend or terminate your account and refuse any and all current or future use of the Yahoo Services (or any portion thereof).\"  Section \"15. TERMINATION\" goes further, stating that, \"You agree that Yahoo may, without prior notice, immediately terminate, limit your access to or suspend your Yahoo account, any associated email address, and access to the Yahoo Services. Cause for such termination, limitation of access or suspension shall include, but not be limited to, (a) breaches or violations of the TOS or other incorporated agreements or guidelines, (b) requests by law enforcement or other government agencies, (c) discontinuance or material modification to the Yahoo Services (or any part thereof), (d) unexpected technical or security issues or problems, (e) extended periods of inactivity, (f) engagement by you in fraudulent or illegal activities, and/or (g) nonpayment of any fees owed by you in connection with the Yahoo Services. Further, you agree that all terminations, limitations of access and suspensions for cause shall be made in Yahoo's sole discretion and that Yahoo shall not be liable to you or any third party for any termination of your account, any associated email address, or access to the Yahoo Services. Termination of your Yahoo account includes any or all of the following: (a) removal of access to all or part of the offerings within the Yahoo Services, (b) deletion of your password and all related information, files and content associated with or inside your account (or any part thereof), and (c) barring of further use of all or part of the Yahoo Services.\"\nIn addition, the Yahoo Community Guidelines (Source 57) state \"Your activity on Yahoo is subject to these Community Guidelines and the Yahoo Terms of Service. If you don’t follow these rules, your account may be deactivated.\". What follows is a list of \"Things to do\" and \"Things not to do\", including \"Don’t use hate speech\" and \"Don’t bully or harass members of the community. \", with further explanations offered.\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: The Yahoo Community Guidelines provide examples of situations that may trigger account restriction, for instance elaborating on what is understood by hate speech, and demanding to not violate the law, for instance \"Don't try to trick people into sharing their personal information, steal anything (like copyright or trademark material), or break into places you shouldn't be.\""}, {"sources": "Source 01: Yahoo TOS\nSource 04: Flickr Guidelines\nSource 57: Yahoo Community Guidelines", "score": "100.00", "type": "video/photo", "name": "Flickr", "comments": "Element 1: Yes, the Yahoo TOS (Source 1), Section \"3. YOUR REGISTRATION OBLIGATIONS\", states that, \"If you provide any information that is untrue, inaccurate, not current or incomplete, or Yahoo has reasonable grounds to suspect that such information is untrue, inaccurate, not current or incomplete, Yahoo has the right to suspend or terminate your account and refuse any and all current or future use of the Yahoo Services (or any portion thereof).\"  Section \"15. TERMINATION\" goes further, stating that, \"You agree that Yahoo may, without prior notice, immediately terminate, limit your access to or suspend your Yahoo account, any associated email address, and access to the Yahoo Services. Cause for such termination, limitation of access or suspension shall include, but not be limited to, (a) breaches or violations of the TOS or other incorporated agreements or guidelines, (b) requests by law enforcement or other government agencies, (c) discontinuance or material modification to the Yahoo Services (or any part thereof), (d) unexpected technical or security issues or problems, (e) extended periods of inactivity, (f) engagement by you in fraudulent or illegal activities, and/or (g) nonpayment of any fees owed by you in connection with the Yahoo Services. Further, you agree that all terminations, limitations of access and suspensions for cause shall be made in Yahoo's sole discretion and that Yahoo shall not be liable to you or any third party for any termination of your account, any associated email address, or access to the Yahoo Services. Termination of your Yahoo account includes any or all of the following: (a) removal of access to all or part of the offerings within the Yahoo Services, (b) deletion of your password and all related information, files and content associated with or inside your account (or any part thereof), and (c) barring of further use of all or part of the Yahoo Services.\"\nIn addition, the Yahoo Community Guidelines (Source 57) state \"Your activity on Yahoo is subject to these Community Guidelines and the Yahoo Terms of Service. If you don’t follow these rules, your account may be deactivated.\". What follows is a list of \"Things to do\" and \"Things not to do\", including \"Don’t use hate speech\" and \"Don’t bully or harass members of the community. \", with further explanations offered.\nSimilarly, the Flickr Community Guidelines (Source 4) outline \"Things not to do\", explaining that \"Here's the deal: We like to give second chances. However, when we discover you stepping across any of the lines listed below, we will take action, which may mean deleting your account with or without warning.\". The list that follows includes things like \"Don't upload anything that isn't yours.\" and \"Don't show nudity in your buddy icon or cover photo.\"\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: The Flickr Community Guidelines (Source 4), section on \"Things not to do\" provides examples of activities that may trigger account restriction. For example, it states, \"Don't upload anything that isn't yours.\nThis includes other people's photos, video, and/or stuff you've copied or collected from around the Internet. Accounts that consist primarily of such collections may be deleted at any time.\" "}, {"sources": "Source 03: Tumblr TOS\nSource 05: Tumblr Community Guidelines", "score": "50.00", "type": "blog", "name": "Tumblr", "comments": "Element 1: Yes, the Tumblr TOS (Source 3) section 16 \"Termination,\" says, \"Tumblr may terminate or suspend your access to or ability to use any and all Services immediately, without prior notice or liability, for any reason or no reason, including but not limited to if you breach any of the terms or conditions of this Agreement. In particular, Tumblr may immediately terminate or suspend Accounts that have been flagged for repeat copyright infringement.\" The section \"Service Changes and Limitations\" states that, \"We can also terminate or suspend any account at any time. That sounds harsh, but we only use that power when we have a reason, as outlined in these Terms of Service, our Privacy Policy, and our Community Guidelines.\" The Community Guidelines (Source 5) states, \"With regard to repeat copyright infringement, we use a three-strike system to evaluate the standing of a user's account, where, generally, each valid copyright infringement notice constitutes a strike, and three strikes results in the termination of a user's account. When a user submits a valid DMCA counter-notification, we remove the associated strike from their record.\" as well as, \"We do our best to ensure fair outcomes, but in all cases we reserve the right to suspend accounts, or remove content, without notice, for any reason, but particularly to protect our services, infrastructure, users, and community.\"\n\nElement 2: This element is N/A for Internet companies.\n\nElement 3: No, neither the Tumblr TOS nor the Tumblr Community Guidelines provides clear examples of situations that may trigger account restriction."}], "type": "Internet", "display": "Yahoo"}], "id": "F4", "name": "F4. Reasons for account or service restriction "}