{"follow": 0, "companies": [{"name": "americaMovil", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "50", "response": "partial"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "americamovil", "score": "25.00", "services": [{"sources": "12,17,22", "score": "25.00", "type": "", "name": "Mobile", "comments": "Element 1: In its Privacy Notice, Telcel instructs users who do not want the company to process their personal data for a reason listed in the document to email a specific address: \"Si usted no desea que Telcel trate sus datos personales para alguna de las finalidades descritas en este apartado, por favor envíe un correo electrónico a datospersonales@telcel.com Usted podrá cambiar de opción en cualquier moment.\" (source 12, p. 2) Furthermore, in the section titled, \"Medio y procedimiento para ejercer Derechos ARCO y/o revocación de consentimiento para el tratamiento de datos personales,” the company explains how users can exercise their access, notification, cancellation, and opposition to the processing of personal data. The bottom of the notice contains a link to the form that users are required to fill out for this process. The Code of Business Practices contains similar language, though it does not provide the link to the relevant form. Instead, it directs users to the Telcel website for the form (source 17, p. 86, \"MEDIOS PARA EJERCER LOS DERECHOS DE ACCESO, RECTIFICACIÓN, CANCELACIÓN U OPOSICIÓN Y REVOVACIÓN DEL CONSENTIMIENTO”) Despite being linked to the Privacy Notice, this form is not easy to locate on the website. Although the company complies with the ARCO policy on personal data, it is not clear if this definition of \"personal data\" includes the technical information that the company collects about users and their usage of the service. For this reason, the company receives partial credit. \n\nElement 2: According to the DLA Piper explanation of Mexico's data protection law, which includes the ARCO process, \"Domestic or international transfers of personal data may be carried out without the consent of the data subject\" provided the third party follows a set of conditions listed in the document (source 22, p. 4, \"Transfer\"). Telcel's Privacy Notice provides that users can follow the same process outlined in element 1 to limit the sharing of their personal information, \"limitar el uso o divulgación de sus datos personales.\" However, the second paragraph of the section suggests that users can only prevent their information from being used to send them promotions, and not for other uses. Specifically, the notice states, \"En caso de que su solicitud resulte procedente, el Departamento de Datos Personales de Telcel lo registrará en el listado de exclusión propio de Telcel con el objeto de que usted deje de recibir nuestras promociones.\" (source 12, p. 2-3, \"Opciones y medios para limitar el uso o divulgación de sus datos personales\") Since it is not clear whether this constitutes an option to control the company's sharing of user information, and there is no evidence that users have options to control other types of sharing, the company does not receive credit for this element."}], "type": "Telecommunications", "display": "America Movil"}, {"name": "at&t", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}], "id": "att", "score": "25.00", "services": [{"sources": "21, 23", "score": "25.00", "type": "", "name": "Mobile", "comments": "Element 1: No evidence that AT&T lets users control what user information AT&T collects. The Choices and Controls document explains how users can opt-out of some third-party data collection services AT&T uses on its apps, but these apps are beyond the scope of this research. \n\nElement 2: AT&T's privacy policy (Source 21, p. 12) section on \"Your Choices and Controls\" states users can opt-out of relevant advertising and online behavioral advertising, but this does not allow users to opt-out of advertising from AT&T. The policy also states that users can opt-out of including their \"anonymous information from [AT&T's] External Marketing & Analytics and other reports\" (Source 21, p. 19). The \"opt-out also applies to the sharing of your anonymous information with other companies for their use in creating marketing and analytics reports. Although this opt out does not apply to Metrics Reports, it will apply if we combine Metrics Report information with other customer information (like demographics) to create reports that we provide to our business customers or service suppliers.\" (Source 21, p. 19). Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit."}, {"sources": "21, 23", "score": "25.00", "type": "", "name": "Fixed Broadband", "comments": "Element 1: No evidence that AT&T lets users control what user information AT&T collects. The Choices and Controls document explains how users can opt-out of some third-party data collection services AT&T uses on its apps, but these apps are beyond the scope of this research. \n\nElement 2: AT&T's privacy policy (Source 21, p. 12) section on \"Your Choices and Controls\" states users can opt-out of relevant advertising and online behavioral advertising, but this does not allow users to opt-out of advertising from AT&T. The policy also states that users can opt-out of including their \"anonymous information from [AT&T's] External Marketing & Analytics and other reports\" (Source 21, p. 19). The \"opt-out also applies to the sharing of your anonymous information with other companies for their use in creating marketing and analytics reports. Although this opt out does not apply to Metrics Reports, it will apply if we combine Metrics Report information with other customer information (like demographics) to create reports that we provide to our business customers or service suppliers.\" (Source 21, p. 19). Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit."}], "type": "Telecommunications", "display": "AT&T"}, {"name": "axiata", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "axiata", "score": "0.00", "services": [{"sources": "7", "score": "0.00", "type": "", "name": "Mobile", "comments": "Elements 1-2: The company's privacy notice (Source 7, Section 4.2.5) states, \"You will be given the opportunity to 'opt-out' of having your Personal Data used for purposes not directly related to the Services or CELCOM’s Websites at the point where CELCOM asks for information. If you do not wish to receive our promotional updates you may opt-out of receiving these communications by contacting CELCOM at the contact numbers listed  below. But please note that should you decide to “opt-out”, we may not be able to provide you with certain Services and your subscription to or application for certain Services may be declined, denied or refused by CELCOM.\" This disclosure suggests that users who opt-out of receiving promotions may not be able to use the service. In addition, the ability to opt-out of receiving promotional updates is not the same thing as controlling what user data the company collects or shares. Since there is no evidence the company provides users with options to control the collection or sharing of user information, the company receives no credit. "}], "type": "Telecommunications", "display": "Axiata"}, {"name": "bhartiAirtel", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "bhartiairtel", "score": "0", "services": [{"sources": "5,9", "score": "0", "type": "", "name": "Mobile", "comments": "Element 1: The privacy policy section on \"Collection of personal information\" (Source 5) states, \"At any time while you are surfing our site, if you do not wish to share surfing information, you may opt out of receiving the cookies from our site by making appropriate changes to your browser privacy settings.\" This option only applies to use of the company's website, and doesn't explain options to control the company's collection of user information through the service. For this reason, the company does not receive credit on this element. \n\nElement 2: The privacy policy section on \"Disclosure and transfer of personal information\" (Source 9) states, \"We may transfer your personal information or other information collected, stored, processed by us to any other entity or organization located in India or outside India only in case it is necessary for providing services to you or if you have consented (at the time of collection of information) to the same.\" This does not specify how users provide consent or whether and how they can adjust that consent beyond the time of information collection. Since this does not clearly explain an option to control the company's sharing of user information, the company does not receive credit on this element."}, {"sources": "5,9", "score": "0", "type": "", "name": "Fixed Broadband", "comments": "Element 1: The privacy policy section on \"Collection of personal information\" (Source 5) states, \"At any time while you are surfing our site, if you do not wish to share surfing information, you may opt out of receiving the cookies from our site by making appropriate changes to your browser privacy settings.\" This option only applies to use of the company's website, and doesn't explain options to control the company's collection of user information through the service. For this reason, the company does not receive credit on this element. \n\nElement 2: The privacy policy section on \"Disclosure and transfer of personal information\" (Source 9) states, \"We may transfer your personal information or other information collected, stored, processed by us to any other entity or organization located in India or outside India only in case it is necessary for providing services to you or if you have consented (at the time of collection of information) to the same.\" This does not specify how users provide consent or whether and how they can adjust that consent beyond the time of information collection. Since this does not clearly explain an option to control the company's sharing of user information, the company does not receive credit on this element."}], "type": "Telecommunications", "display": "Bharti Airtel"}, {"name": "etisalat", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "etisalat", "score": "0.00", "services": [{"sources": "3, 6, 8, 9", "score": "0.00", "type": "", "name": "Mobile", "comments": "This includes a review of Etisalat's Privacy Policy and the postpaid TOS, since it is unclear whether the privacy policy applies to the postpaid service. \n\nEtisalat's privacy policy (Arabic-Source 8; English-Source 9) section on \"Direct Marketing\" says users may unsubscribe from marketing offers, but this is not an option to control Etisalat's collection or sharing of user information. \n\nThe postpaid TOS (Arabic-Source 3; English-Source 6, section 11.d) says, \"Etisalat will not share personal information of the Customer with any of its associated entities or other third parties not involved in the provision of the Services without the consent of the Customer. The Customer gives Etisalat the right to disclose the personal information of the Customer to third parties for the purpose of credit checking, security, fraud prevention or identity verification purposes.\" However it is unclear how the user can provide or rescind consent. For this reason, the company receives no credit for both elements."}, {"sources": "8,9", "score": "0.00", "type": "", "name": "Fixed Broadband", "comments": "This includes a review of Etisalat's Privacy Policy, since the eLife TOS specify that the policy covers this service. \n\nEtisalat's privacy policy (Arabic-Source 8; English-Source 9) section on \"Direct Marketing\" says users may unsubscribe from marketing offers, but this is not an option to control Etisalat's collection or sharing of user information. "}], "type": "Telecommunications", "display": "Etisalat"}, {"name": "facebook", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "50", "response": "partial"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "facebook", "score": "8.33", "services": [{"sources": "23, 92, 93, 94, 95", "score": "25.00", "type": "social network", "name": "Facebook", "comments": "Element 1: Facebook's Help Center also has information to help users manage settings for various other types of information, like Location Information (Source 93), where the company states, \"When you turn off Location History, Facebook will stop adding new information to your activity log.\" However, these options do not enable users to control the company's collection of their information. \n\nElement 2: Facebook's \"Privacy Basics\" (Source 92) section on \"What Others See About You\" provides extensive controls to help users manage the visibility of their content. However, this element focuses on whether the user has options to control what user information the company shares, not how users manage the content they themselves have shared. Its Help Center page on \"Making Ads Better\" (Source 94) explains how users can manage their ad preferences. However, this does not allow users to opt-out of having their information shared for advertising purposes. Facebook's Help Center page on App Privacy Settings (Source 95) explains how users can turn off Facebook's integration with apps, games, and websites. Since this provides users with some control over how their information is shared, the company receives partial credit."}, {"sources": "4", "score": "0.00", "type": "IM & calls", "name": "Whatsapp", "comments": "Element 1: The only control WhatsApp provides to users is the option to delete their account. Under the \"Your Choices” section its legal policy (Source 4) the company informs users, \"You may, of course, decline to submit Personally Identifiable Information through the WhatsApp Site or the WhatsApp Service, in which case WhatsApp may not be able to provide certain services to you. If you do not agree with our Privacy Policy or Terms of Service, please delete your account, uninstall the WhatsApp mobile application and discontinue use of the WhatsApp Service\"\n\nElement 2: In its Legal policy (Source 4), WhatsApp states, \"We do not sell or share your Personally Identifiable Information (such as mobile phone number) with other third-party companies for their commercial or marketing use without your consent or except as part of a specific program or feature for which you will have the ability to opt-in or opt-out.” However this does not explain how or at what point users provide consent for such sharing. Since this does not clearly explain an option to control the company's sharing of user information, the company does not receive credit on this element."}, {"sources": "25, 96, 97", "score": "0.00", "type": "social network", "name": "Instagram", "comments": "Element 1: The Instagram Privacy Policy (Source 25), does not disclose any user options to control information collection.\n\nElement 2: The Instagram Help Center page on \"Controlling Your Visibility\" (Source 97) shows how users can limit how their user content is shared on the service. However, this element focuses on whether the user has options to control what user information the company shares, not how users manage the content they themselves have shared. The Instagram Help Center page on managing ads (Source 96) states that users can opt-out of seeing ads based on their activity on sites and apps, but that users cannot opt-out of seeing ads based on their Instagram activity. This suggests that user information is still shared with advertisers. Since there is no evidence that users can control what user information the company shares, the company does not receive credit on this element."}], "type": "Internet", "display": "Facebook"}, {"name": "google", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "google", "score": "25.00", "services": [{"sources": "41", "score": "25.00", "type": "search engine", "name": "Search", "comments": "Element 1: The \"My Account\" dashboard (Source 129) provides an \"opt-out\" style control option to control collection of data, even when not signed-in to an account. The Privacy Check-up tool (Source 128) displays all of the tools available for users who are not signed in.  This provides simple controls for Search, Youtube, and Ads. However, the option for Google Analytics requires a user to install additional software which may not be possible depending on the computing environment and constitutes a significant burden for the non-technically literate. It is furthermore not clear if the above settings include all of the data Google may possess about a user, such as retained log data or other information associated with a particular IP. Given this, Google receives partial credit.\n\nElement 2: The Privacy Policy (Source 41) section on \"Information We Share\" explains the circumstances in which the company shares user information. There is no evidence users have options to control this sharing. For example, the section \"For external processing\" states, \"We provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\" It is unclear from this if, or how, a user would limit sharing to \"other trusted businesses.\""}, {"sources": "41", "score": "25.00", "type": "mail service", "name": "Gmail", "comments": "Element 1: The \"My Account\" dashboard (Source 129) provides an \"opt-out\" style control option to control collection of data, even when not signed-in to an account. The Privacy Check-up tool (Source 128) displays all of the tools available for users who are not signed in.  This provides simple controls for Search, Youtube, and Ads. However, the option for Google Analytics requires a user to install additional software which may not be possible depending on the computing environment and constitutes a significant burden for the non-technically literate. It is furthermore not clear if the above settings include all of the data Google may possess about a user, such as retained log data or other information associated with a particular IP. Given this, Google receives partial credit.\n\nElement 2: The Privacy Policy (Source 41) section on \"Information We Share\" explains the circumstances in which the company shares user information. There is no evidence users have options to control this sharing. For example, the section \"For external processing\" states, \"We provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\" It is unclear from this if, or how, a user would limit sharing to \"other trusted businesses.\""}, {"sources": "41", "score": "25.00", "type": "video/photo", "name": "Youtube", "comments": "Element 1: The \"My Account\" dashboard (Source 129) provides an \"opt-out\" style control option to control collection of data, even when not signed-in to an account. The Privacy Check-up tool (Source 128) displays all of the tools available for users who are not signed in.  This provides simple controls for Search, Youtube, and Ads. However, the option for Google Analytics requires a user to install additional software which may not be possible depending on the computing environment and constitutes a significant burden for the non-technically literate. It is furthermore not clear if the above settings include all of the data Google may possess about a user, such as retained log data or other information associated with a particular IP. Given this, Google receives partial credit.\n\nElement 2: The Privacy Policy (Source 41) section on \"Information We Share\" explains the circumstances in which the company shares user information. There is no evidence users have options to control this sharing. For example, the section \"For external processing\" states, \"We provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\" It is unclear from this if, or how, a user would limit sharing to \"other trusted businesses.\""}], "type": "Internet", "display": "Google"}, {"name": "kakao", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "kakao", "score": "0.00", "services": [{"sources": "", "score": "0.00", "type": "search engine", "name": "Daum Search", "comments": "No evidence found."}, {"sources": "", "score": "0.00", "type": "mail service", "name": "Daum Mail", "comments": "No evidence found."}, {"sources": "", "score": "0.00", "type": "IM & calls", "name": "Kakaotalk", "comments": "No evidence found."}], "type": "Internet", "display": "Kakao"}, {"name": "mailRu", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "mailru", "score": "0.00", "services": [{"sources": "4,5", "score": "0.00", "type": "social network", "name": "Vkontakte", "comments": "Element 1: The ToS discloses user rights to control “data processing” and not data collection.\" It states, \"the User has the right to revoke his/her consent for processing his/her personal data by:(a) removing independently the information posted previously by the User on the Site; (b) removing independently the User’s personal page using the “Remove Your Page” functionality available to the User in the “My Settings” (Source 4, section 5.14). However, this indicator seeks disclosure that the company provides users with an option to control the company's collection of data about the user and the user's behavior on the service. There is no evidence that the company offers these types of controls, and for this reason, the company does not receive credit on this element.\n\nElement 2: While users are permitted to adjust their privacy settings in order to control what information they share with other users, there is no indication that there are similar options to control how the company shares user information (Source 5, section 6.3)."}, {"sources": "8", "score": "0.00", "type": "mail service", "name": "Mail", "comments": "Element 1: There is no evidence that Mail.Ru provides users with the option to control its collection of their information.\n\nElement 2: Mail.Ru's User Agreement says it reserves the right to share user information and does not provide users with the option to exercise control in this regard (Source 8, section 7.2)."}, {"sources": "8", "score": "0.00", "type": "", "name": "Mail.ru Agent", "comments": "Element 1: There is no evidence that Mail.Ru provides users with the option to control its collection of their information.\n\nElement 2: Mail.Ru's User Agreement says it reserves the right to share user information and does not provide users with the option to exercise control in this regard (Source 8, section 7.2)."}], "type": "Internet", "display": "Mail.Ru"}, {"name": "microsoft", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}], "id": "microsoft", "score": "25.00", "services": [{"sources": "5", "score": "25.00", "type": "search engine", "name": "Bing", "comments": "Element 1: Microsoft's Privacy Statement (Source 5), section on Personal Data We Collect\" states, \"You have choices about the data we collect. When you are asked to provide personal data, you may decline. But if you choose not to provide data that is necessary to provide a service, you may not be able to use some features or services.\" However, this does not provide detail on what options users have to control the company's collection of their user information.\n\nElement 2: Microsoft's Privacy Statement (Source 5), section on \"How to Access & Control Your Personal Data\" provides users with a few ways to opt-out of receiving \"interest-based advertising.\" However, the policy states, \"Because the data used for interest-based advertising is also used for other necessary purposes (including providing our services, analytics and fraud detection), opting out of interest-based advertising does not stop that data from being collected. Nor does it mean you will stop getting ads or see fewer ads. However, if you do opt out, the ads you receive will no longer be interest-based and may be less relevant to your interests.\" Thus, user information is still being shared for advertising purposes. However, the privacy stement's section on \"Cookies & Similar Technologies,\" section on \"Our Use of Web Beacons and Analytics Services\" provides links where users can opt-out of various analytics services. Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit."}, {"sources": "5", "score": "25.00", "type": "mail service", "name": "Outlook.com", "comments": "Element 1: Microsoft's Privacy Statement (Source 5), section on Personal Data We Collect\" states, \"You have choices about the data we collect. When you are asked to provide personal data, you may decline. But if you choose not to provide data that is necessary to provide a service, you may not be able to use some features or services.\" However, this does not provide detail on what options users have to control the company's collection of their user information.\n\nElement 2: Microsoft's Privacy Statement (Source 5), section on \"How to Access & Control Your Personal Data\" provides users with a few ways to opt-out of receiving \"interest-based advertising.\" However, the policy states, \"Because the data used for interest-based advertising is also used for other necessary purposes (including providing our services, analytics and fraud detection), opting out of interest-based advertising does not stop that data from being collected. Nor does it mean you will stop getting ads or see fewer ads. However, if you do opt out, the ads you receive will no longer be interest-based and may be less relevant to your interests.\" Thus, user information is still being shared for advertising purposes. However, the privacy stement's section on \"Cookies & Similar Technologies,\" section on \"Our Use of Web Beacons and Analytics Services\" provides links where users can opt-out of various analytics services. Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit.\n\nONLY SOURCE 5"}, {"sources": "5", "score": "25.00", "type": "IM & calls", "name": "Skype", "comments": "Element 1: Microsoft's Privacy Statement (Source 5), section on Personal Data We Collect\" states, \"You have choices about the data we collect. When you are asked to provide personal data, you may decline. But if you choose not to provide data that is necessary to provide a service, you may not be able to use some features or services.\" However, this does not provide detail on what options users have to control the company's collection of their user information.\n\nElement 2: Microsoft's Privacy Statement (Source 5), section on \"How to Access & Control Your Personal Data\" provides users with a few ways to opt-out of receiving \"interest-based advertising.\" However, the policy states, \"Because the data used for interest-based advertising is also used for other necessary purposes (including providing our services, analytics and fraud detection), opting out of interest-based advertising does not stop that data from being collected. Nor does it mean you will stop getting ads or see fewer ads. However, if you do opt out, the ads you receive will no longer be interest-based and may be less relevant to your interests.\" The privacy statement (Source 5) section on Skype includes a similar statement that enables users to opt-out of interest-based advertising, however, \"you will still receive advertisements based on your country of residence, language preference, and IP address location, but other data is not used for ad targeting\"  Thus, user information is still being shared for advertising purposes. There is no evidence that users can control what user information the company shares. However, the privacy stement's section on \"Cookies & Similar Technologies,\" section on \"Our Use of Web Beacons and Analytics Services\" provides links where users can opt-out of various analytics services. Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit.\n\nONLY SOURCE 5"}], "type": "Internet", "display": "Microsoft"}, {"name": "mtn", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}], "id": "mtn", "score": "0.00", "services": [{"sources": "11", "score": "0.00", "type": "", "name": "Mobile", "comments": "The privacy policy (Source 11) Section 10.2, \"Direct Marketing,\" says, \"You have the right to choose whether you receive marketing material or not. By accepting this policy you are also agreeing to MTN sending you marketing material on related services, products and offerings provided from MTN from time to time. If you change your mind at any time, you are always able to opt out.\" It is not clear if opting out means revoking acceptance of the policy, which would most likely mean losing the ability to use the service.\n\nNevertheless, this does not contain any information about users' abilities to control what user information the company collects or shares. For this reason, the company does not receive credit on this indicator."}], "type": "Telecommunications", "display": "MTN"}, {"name": "orange", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "orange", "score": "0.00", "services": [{"sources": "2", "score": "0.00", "type": "", "name": "Mobile", "comments": "The following information was found in the mobile ToS (Source 2, section 22) unless otherwise noted.\n\nElement 1: No evidence found.\n\nElement 2: In its subscription conditions to mobile service, Orange indicates that customers can 'oppose' the sharing of their information in a number of cases such as 1) adding their data to the  GIE PREVENTEL database or 2) or sharing their data with other companies of the Orange group. However, the company does not clarify whether an 'opposition' could eventually allow the user to 'opt out' of the sharing of his/her data."}, {"sources": "1, 12, 13, 14, 15, 16", "score": "0.00", "type": "", "name": "Fixed Broadband", "comments": "The following information was found in the broadband ToS (Source 1, article 18;  Source 12, article 16; Source 13, article 19; Source 14, article 16; Source 15, article 19; Source 16, article 18) unless otherwise noted.\n\nIn its subscription conditions to fixed broadband services, Orange acknowledges a users' right to 'access, rectify or oppose' the processing of their personal data. However, the conditions do not mention whether such 'opposition' could eventually allow the user to 'opt out' of sharing or collecting of his/her data. In the 'internet pro fibre conditions', (Source 16) this right does not apply in cases where Orange needs to communicate service and subscription related information to users."}], "type": "Telecommunications", "display": "Orange"}, {"name": "tencent", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "tencent", "score": "0.00", "services": [{"sources": "6,7", "score": "0.00", "type": "social network", "name": "Qzone", "comments": "Tencent states that its Privacy Policy applies across its services. The Chinese version of the policy (Source 6) applies to users in mainland China, and the English version of the policy (Source 7) applies to users outside mainland China. \n\nElement 1: No evidence found.\n\nElement 2: The privacy policy that applies to users outside mainland China (Source 7) states: \"We will honor your request for us to not use your Personal Information for the marketing purposes noted above.  If you wish to make such a request, please: (i) notify our Privacy Officer; (ii) follow the relevant instructions on our marketing communications; or (iii) follow the instructions as set out in certain service-specific guidance (in relation to the relevant service). Please note that we will not share your Personal Information with advertisers unless you have given us your consent to do so.  We do, however, share Non-Personal Information with advertisers for the purposes of trying to offer you advertising that is more relevant to you.\" This does not explain how users provide consent for sharing personal information with advertisers. The version of the policy that applies to users in mainland China (Source 6) also mentions that users can inform the company if they do not want the company to use information for advertising, but it does not explain how users can do so, nor does it mention a privacy grievance officer. In addition, this disclosure only focuses on one type of sharing and there is no evidence that users can control other aspects of the company's sharing of their user information. For this reason, the company does not receive credit on this element. "}, {"sources": "6,7", "score": "0.00", "type": "IM & calls", "name": "Qq", "comments": "Tencent states that its Privacy Policy applies across its services. The Chinese version of the policy (Source 6) applies to users in mainland China, and the English version of the policy (Source 7) applies to users outside mainland China. \n\nElement 1: No evidence found.\n\nElement 2: The privacy policy that applies to users outside mainland China (Source 7) states: \"We will honor your request for us to not use your Personal Information for the marketing purposes noted above.  If you wish to make such a request, please: (i) notify our Privacy Officer; (ii) follow the relevant instructions on our marketing communications; or (iii) follow the instructions as set out in certain service-specific guidance (in relation to the relevant service). Please note that we will not share your Personal Information with advertisers unless you have given us your consent to do so.  We do, however, share Non-Personal Information with advertisers for the purposes of trying to offer you advertising that is more relevant to you.\" This does not explain how users provide consent for sharing personal information with advertisers. The version of the policy that applies to users in mainland China (Source 6) also mentions that users can inform the company if they do not want the company to use information for advertising, but it does not explain how users can do so, nor does it mention a privacy grievance officer. In addition, this disclosure only focuses on one type of sharing and there is no evidence that users can control other aspects of the company's sharing of their user information. For this reason, the company does not receive credit on this element. "}, {"sources": "6,22 23", "score": "0.00", "type": "IM & calls", "name": "Wechat", "comments": "Tencent states that its Privacy Policy applies across its services. WeChat also has a separate privacy policy for users outside of mainland China (Source 22-Traditional Chinese version, Source 23-English version). Notably, these policies (Sources 22, 23) feature the TRUSTe seal while Tencent’s Privacy Policy (Source 6) does not.\n\nElement 1: No evidence found.\n\nElement 2: The privacy policy that applies to users in mainland China (Source 6) mentions that users can inform the company if they do not want the company to use information for advertising, but it does not explain how users can do so. There is no evidence in the policy that applies to users outside mainland China (Sources 22, 23)."}], "type": "Internet", "display": "Tencent"}, {"name": "twitter", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}]}], "id": "twitter", "score": "25.00", "services": [{"sources": "19, 25, 45, 105", "score": "25.00", "type": "social network", "name": "Twitter", "comments": "Element 1: Twitter's privacy policy (Source 19) states that users decide not to provide \"Additional Information\", which consists of profile information like bio, website link and picture. However, this focuses on user-generated content, while this indicator seeks disclosure that the company provides users with options to control the company's collection of data about the user and the user's behavior on the service. For example, users may not opt out of location information being inferred from their IP address and WiFi information. In order to prevent collection of location information in this manner, Twitter states that users may change their WiFi network name (source 45), a highly impractical approach since users may not be the administrators of the networks they use.\n\nElement 2: Twitter's page on cookies (Source 25) states that users can opt-out of Twitter's data sharing with Google Analytics and intere-based adverstising from Google and provides links where users can enable those options. Twitter's page on brand impact and privacy controls (Source 105) states that users can opt-out of Twitter's data sharing with Datalogix and explains how. Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit."}, {"sources": "57", "score": "25.00", "type": "video/photo", "name": "Vine", "comments": "Element 1: Although Vine's Privacy Policy (Source 57) states that some parts of a public profile (e.g. \"short bio, location, and profile picture\") are optional, it fails to give the user broader control over information collection (such as Log Data). \n\nElement 2: Vine's Privacy Policy (Source 57) has links to opt-out of Google Analytics. Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit."}], "type": "Internet", "display": "Twitter"}, {"name": "vodafone", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "50", "response": "partial"}]}], "id": "vodafone", "score": "25.00", "services": [{"sources": "25, 40", "score": "25.00", "type": "", "name": "Mobile", "comments": "Element 1: Vodafone's third privacy commitment is: \"Choice: We give people the ability to make simple and meaningful choices about their privacy.\" (Source 40, p. 58). Further in its 2014/15 Sustainability report (Source 40, p. 62, section 'A new approach to transparency') Vodafone explains: \"Personal data belongs to our customers. We are building tools that put them in control by enabling them to easily view and update the permissions they grant to use their data. (...)[W]e are rolling out improved tools for our customers that will enable them to take control of their personal information so that they can easily see the type of information Vodafone holds about them, find out how this information is used and consent or withdraw their permission for its use. We intend for these tools to be accompanied by a clear promise to our customers which details how we will treat their data, written in terms they can understand.\" However, no further disclosure on the group-level indicates how this is being implemented, what data use customers can change permissions for, etc. For this reason, the company does not receive credit on this element.\n\nElement 2: Vodafone UK's privacy policy (Source 25) states that users can opt out of “Vodafone Analytics”, which means that the user’s info will not be included in the data Vodafone sells to external parties. Vodafone Analytics is basically data sold to marketers: “We collect data from our network and our customer base to produce reports for third parties. This helps them make better decisions. Vodafone Analytics uses two categories of data...Anonymized aggregated location information...Anonymized demographic data”. Since this only allows users to control one aspect of the company's sharing of their information, the company receives partial credit."}], "type": "Telecommunications", "display": "Vodafone"}, {"name": "yahoo", "levels": [{"text": "1. The company provides users with options to control the company’s collection of their information.", "scores": [{"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}, {"score": "0", "response": "no/insufficient evidence"}]}, {"text": "2. The company provides users with options to control the company’s sharing of their information.", "scores": [{"score": "50", "response": "partial"}, {"score": "50", "response": "partial"}, {"score": "0", "response": "no/insufficient evidence"}]}], "id": "yahoo", "score": "16.67", "services": [{"sources": "18, 26, 58", "score": "25.00", "type": "mail service", "name": "Mail", "comments": "Element 1: No, neither Yahoo's Privacy Policy (Source 18) nor Yahoo Mail's Privacy Policy (Source 58) provide sufficient details on options to control collection.\n\nElement 2: The Yahoo Privacy Policy (Source 18) section on \"Cookies and Similar Technologies\" says, \"You can control your personalized experience across Yahoo through our Ad Interest Manager.\" Yahoo Mail's Privacy Policy (Source 58) says it may use information collected for \"interest-based advertising. To learn more, you can visit Yahoo’s control tool for interest-based advertising.\" Both of these sentences include links to the \"Yahoo Ad Interest Manager\" (Source 26), which states, \"You can opt out of... the sharing of your information with partners for data matching and appends.\" This suggests that users can limit the sharing of their information for ad-related purposes, but it is unclear whether users can control other types of sharing. For this reason, the company receives partial credit."}, {"sources": "18, 26, 59", "score": "25.00", "type": "video/photo", "name": "Flickr", "comments": "Element 1: Flickr's Privacy Policy (Source 59) states, \"Unless you turn off EXIF data on your camera or device or remove it from the picture before uploading to Flickr, Flickr receives and stores EXIF data.\" This provides users with a helpful tip, however, it focuses on information related to user-generated content. This indicator seeks disclosure that the company provides users with options to control the company's collection of data about the user and the user's behavior on the service. There is no evidence that the company offers these types of controls, and for this reason, the company does not receive credit on this element.\n\nElement 2: Flickr's Privacy Policy (Source 59) section on \"Information Collection, Use & Sharing Practices\" describes how users can limit sharing of photos and account information. However, this element focuses on whether the user has options to control what user information the company shares, not how users manage the content they themselves have shared.  Yahoo's Privacy Policy (Source 18) section on \"Cookies and Similar Technologies\" says, \"You can control your personalized experience across Yahoo through our Ad Interest Manager.\" This links to the \"Yahoo Ad Interest Manager\" (Source 26), which states, \"You can opt out of... the sharing of your information with partners for data matching and appends.\" This suggests that users can limit the sharing of their information for ad-related purposes, but it is unclear whether users can control other types of sharing. For this reason, the company receives partial credit."}, {"sources": "20", "score": "0.00", "type": "blog", "name": "Tumblr", "comments": "Element 1: The Tumblr Privacy Policy (Source 20) does not provide sufficient details on options to control collection.\n\nElement 2: The Tumblr Privacy Policy (Source 20) emphasizes the public nature of Tumblr and states, \"The content you create on Tumblr is, by default, public. This means that anyone can see it, and that search engines can index it. If these things bother you, take a look at some of the additional privacy features we offer.\" These privacy features (Source 76) include password protecting blogs. However, this element focuses on whether the user has options to control what user information the company shares, not how users manage the content they themselves have shared. There is no evidence that users have options to control the company's sharing of their data."}], "type": "Internet", "display": "Yahoo"}], "id": "P5", "name": "P5. User control over information collection and sharing "}